{"AAPL": {"name": ["<b>AAPL</b> Stock Today: How To Trade The Upcoming Earnings With Options", "Apple&#39;s iPhone Share in China Shows Positive Momentum, India Emerges as Rapidly Growing Market: Analyst Says Ahead Of Q3", "Apple (<b>AAPL</b>) Receives a Buy from Monness", "Piper Sandler Maintains Apple (<b>AAPL</b>) Overweight Recommendation", "As Disney Leads the Week in Unusual Options Flow, NVDA, <b>AAPL</b>, XPEV Follow", "Apple Inc. (<b>AAPL</b>) Stock Faces 1.41% Weekly Volatility", "Earnings Extravaganza: Another One-Third Of S&amp;P 500 Companies Report This Week, Including Amazon, Apple", "Here’s Why You Should Hold Apple (<b>AAPL</b>) for the Long-Term", "Elliott Wave analysis: <b>AAPL</b> and top tech stocks [Video]", "<b>Apple Inc</b>"], "description": ["Therefore, let&#39;s look at a combination of two options strategies in <b>AAPL</b> stock that would benefit from the market&#39;s reaction to the news. Please watch the video at Investors.com - Option Trade In Apple Stock Could Net 35% Return If Shares Stay In This ...", "Kumar estimates that Apple gets roughly 10% of its sales from phones in China. Assuming the Chinese market declines in the mid-single digits and Apple keeps up with that pace (worst case scenario), the impact will only amount to 0.5% of Apple&#39;s iPhone sales within the quarter.", "In a report released today, Brian White from Monness maintained a Buy rating on Apple (AAPL – Research Report), with a price target of", "Fintel reports that on July 31, 2023, Piper Sandler maintained coverage of Apple (NASDAQ:AAPL) with a Overweight recommendation. Analyst Price Forecast Suggests 1.83% Downside As of July 6, 2023, the average one-year price target for Apple is 192.", "Many investors brush off or ignore options trading because options are complex and misunderstood. However, many other traders have learned how to “follow the flow.” In other words, they want to know what the big funds and institutions are doing.", "The stock of Apple Inc. (AAPL) has gone up by 2.03% for the week, with a 3.48% rise in the past month and a 16.28% rise in the past quarter. The volatility ratio for the week is 1.41%, and the volatility levels for the past 30 days are 1.", "It’s “tech week” on Wall Street. No, wait, it’s “pharma week.” Or is it “employment week?” How about all three?", "Wedgewood Partners, an investment management company, released its “Wedgewood Partners Large Cap Focused Growth Fund” second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter,", "Investors keen on intraday trading should note that some of these stocks still exhibit corrective patterns during specific trading hours. However, it is important to highlight that these corrective patterns seem to be transient,", "With lumber stocks, you couldn&#39;t see the forest for the trees for a while. But these picks are clearing the way."], "datePublished": ["2023-07-31T18:54:00.0000000Z", "2023-07-31T19:36:00.0000000Z", "2023-07-31T11:45:00.0000000Z", "2023-07-31T17:06:12.0000000Z", "2023-07-31T11:55:00.0000000Z", "2023-07-31T04:44:00.0000000Z", "2023-07-31T16:12:00.0000000Z", "2023-07-20T10:34:00.0000000Z", "2023-07-30T21:09:00.0000000Z", "2023-07-27T23:59:00.0000000Z"], "url": ["https://www.msn.com/en-us/money/topstocks/aapl-stock-today-how-to-trade-the-upcoming-earnings-with-options/ar-AA1eBrDm", "https://markets.businessinsider.com/news/stocks/apple-s-iphone-share-in-china-shows-positive-momentum-india-emerges-as-rapidly-growing-market-analyst-says-ahead-of-q3-1032496838", "https://markets.businessinsider.com/news/stocks/apple-aapl-receives-a-buy-from-monness-1032495034", "https://www.msn.com/en-us/money/savingandinvesting/piper-sandler-maintains-apple-aapl-overweight-recommendation/ar-AA1eBqt6", "https://247wallst.com/investing/2023/07/31/as-disney-leads-the-week-in-unusual-options-flow-nvda-aapl-xpev-follow/", "https://newsheater.com/2023/07/31/apple-inc-aapl-stock-faces-1-41-weekly-volatility/", "https://www.benzinga.com/news/earnings/23/07/33474441/earnings-extravaganza-another-one-third-of-s-p-500-companies-report-this-week-including-amazon-appl", "https://news.yahoo.com/why-hold-apple-aapl-long-103432783.html", "https://www.fxstreet.com/news/elliott-wave-analysis-aapl-and-top-tech-stocks-video-202307302109", "https://money.usnews.com/investing/stocks/aapl-apple-inc/vitals"], "texts": ["", "Piper Sandler analyst Harsh Kumar maintained Apple Inc (NASDAQ:AAPL) with an Overweight and raised the price target from $180 to $220. Overall, Kumar feels Apple can execute its key segments and markets for the June quarter. More importantly, he estimates that Apple will deliver September assumptions that will match or slightly exceed street expectations primarily driven by strength in India for iPhone sales offset by general macro weakness in China. For June, the analyst expects Apple to slightly miss street EPS expectations of $1.19 by between $0.02 to $0.04 and deliver revenue marginally lower than the street's $81.7 billion for", "In a report released today, Brian White from Monness maintained a Buy rating on Apple (AAPL – Research Report), with a price target of $188.00. The company’s shares closed last Friday at $195.83. White covers the Technology sector, focusing on stocks such as Apple, Elastic, and Salesforce. According to TipRanks, White has an average return of 20.7% and a 67.48% success rate on recommended stocks. In addition to Monness, Apple also received a Buy from Piper Sandler’s Harsh Kumar in a report issued today. However, on the same day, Bank of America Securities maintained a Hold rating on Apple (NASDAQ:", "", "As Disney Leads the Week in Unusual Options Flow, NVDA, AAPL, XPEV Follow Many investors brush off or ignore options trading because options are complex and misunderstood. However, many other traders have learned how to “follow the flow.” In other words, they want to know what the big funds and institutions are doing. When these buyers make their move in the options world, they leave a trail behind them — footsteps in the data. We can follow those footsteps when looking for unusual options activity. Our guide is Fintel’s leaderboard of options activity, showing the action in both calls and", "The stock of Apple Inc. (AAPL) has gone up by 2.03% for the week, with a 3.48% rise in the past month and a 16.28% rise in the past quarter. The volatility ratio for the week is 1.41%, and the volatility levels for the past 30 days are 1.43% for AAPL. The simple moving average for the past 20 days is 2.01% for AAPL’s stock, with a 23.59% simple moving average for the past 200 days. Is It Worth Investing in Apple Inc. (NASDAQ: AAPL) Right Now? The price-to-earnings ratio for Apple Inc. (NASDAQ: AAPL) is above average at 33.27x,", "(Monday market open) It’s “tech week” on Wall Street. No, wait, it’s “pharma week.” Or is it “employment week?” How about all three? Today’s calendar is relatively light, but investors await word from Apple AAPL, Amazon AMZN, and two of the biggest pharmaceutical companies later this week, followed by Friday’s not-to-be-missed July Nonfarm Payrolls report. Last week featured roughly one-third of all S&P 500 companies reporting earnings, and the coming days are packed again. The biggest are Tuesday, when Merck MRK and Pfizer PFE roll out quarterly results in the morning followed by Advanced Micro Devices AMD in the afternoon,", "Wedgewood Partners, an investment management company, released its \"Wedgewood Partners Large Cap Focused Growth Fund\" second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter, Wedgewood Composite’s net return was 8.1% compared to the Standard & Poor’s 8.7%, Russell 1000 Growth Index’s 12.8%, and Russell 1000 Value Index’s 4.1% return for the same period. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Wedgewood Partners Large Cap Focused Growth Fund highlighted stocks like Apple Inc. (NASDAQ:AAPL) in the second quarter 2023 investor", "Share: Stock Market Report: Analyzing NASDAQ Stocks - Apple (AAPL), Tesla (TSLA), Amazon (AMZN), Nvidia (NVDA), Microsoft (MSFT), Meta Platforms, Netflix (NFLX), Alphabet (GOOGL). The stock market has been witnessing notable trends in the NASDAQ stocks, with Apple (AAPL), Tesla (TSLA), Amazon (AMZN), Nvidia (NVDA), Microsoft (MSFT), Meta Platforms, Netflix (NFLX), and Alphabet (GOOGL) drawing significant attention from investors. As of the latest analysis, the overall market sentiment appears to be favorable, with monthly, weekly, and daily trends all indicating bullish patterns. Investors keen on intraday trading should note that some of these stocks still exhibit corrective patterns during specific", "Invested Advice, rankings and one great story every day. Sign Up Sign up to receive the latest updates from U.S. News & World Report and our trusted partners and sponsors. By clicking submit, you are agreeing to our Terms and Conditions & Privacy Policy."], "sentiments": ["positive", "positive", "positive", "positive", "neutral", "positive", "neutral", "neutral", "positive", "positive"], "summaries": ["All photographs subject to copyright.", "Piper Sandler raises price target to $220 from $180. Apple can execute its key segments and markets, Kumar says", "Monness analyst Brian White maintains a Buy rating on Apple with a $188.00 price target.", "All photographs subject to copyright.", "Fintel shows unusual options activity in NVDA, XPEV. Disney leads the week in unusual options flow", "Apple has gone up by 2.03% for the week, with a 3.48% rise in the past month and a 16.28% rise in the past", "Apple, Amazon and two of the biggest pharmaceutical companies report. Investors await word on U.S. jobs, China trade talks", "In the second quarter, the fund returned 8.1% compared to S&P, Russell 1000 Growth Index, and Russell 1000 Value Index.", "Weekly, monthly, and daily trends all indicate bullish patterns.", "FTSE 100 tumbles as Brexit uncertainty grows"]}, "AVGO": {"name": ["Is Broadcom (<b>AVGO</b>) a Smart Long-Term Buy?", "<b>AVGO</b> Jul 2023 842.500 put", "Why Broadcom Inc. (NASDAQ: <b>AVGO</b>) Is A Great Stock Pick For Momentum Investors", "This Is What Whales Are Betting On Broadcom", "Best Dividend Stock to Buy: AT&amp;T vs. Broadcom", "<b>AVGO</b> Factor-Based Stock Analysis", "<b>AVGO</b> Quantitative Stock Analysis", "<b>Broadcom Inc</b>", "Broadcom: The Gift That Keeps On Giving (And Giving And Giving)", "Broadcom Inc. (<b>AVGO</b>) Shares Soar Above 1-Year High"], "description": ["Aristotle Atlantic Partners, an investment management firm, released its second quarter 2023 investor letter, a copy of which can be downloaded here. For the second quarter of 2023, Aristotle Atlantic’s Core Equity Composite posted a total return of 9.", "By 2030, a new report from the consulting firm McKi Fool.com contributor Parkev Tatevosian compares AT&amp;T (NYSE: T) and Broadcom (NASDAQ: <b>AVGO</b>) on dividend yield, operating profit margin, and forward price-to-earnings ratio to answer which stock is better ...", "Broadcom Inc. (NASDAQ:AVGO) shares, rose in value on Friday, 07/28/23, with the stock price up by 0.70% to the previous day’s close as strong demand from buyers drove the stock to $899.79. Actively observing the price movement in the last trading,", "Taking into account the Volume and Open Interest on these contracts, it appears that whales have been targeting a price range from $370.0 to $1000.0 for Broadcom over the last 3 months.", "Fool.com contributor Parkev Tatevosian compares AT&amp;T ( T -2.55%) and Broadcom ( AVGO 0.05%) on dividend yield, operating profit margin, and forward price-to-earnings ratio to answer which stock is better for passive income investors.", "Below is Validea&#39;s guru fundamental report for BROADCOM INC (<b>AVGO</b>). Of the 22 guru strategies we follow, <b>AVGO</b> rates highest using our Twin Momentum Investor model based on the published strategy ...", "Below is Validea&#39;s guru fundamental report for BROADCOM INC (<b>AVGO</b>). Of the 22 guru strategies we follow, <b>AVGO</b> rates highest using our Twin Momentum Investor model based on the published strategy ...", "With lumber stocks, you couldn&#39;t see the forest for the trees for a while. But these picks are clearing the way.", "This article was coproduced with Chuck Walston. When my Strong Buy rating on Broadcom (NASDAQ:<b>AVGO</b>) appeared on 10/17/22, the shares traded for $435. I downgraded the stock to a Buy in a follow-up ...", "Broadcom Inc. (NASDAQ: AVGO) has seen a rise in its stock price by 0.95 in relation to its previous close of 888.34. However, the company has experienced a 0.92% gain in its stock price over the last five trading sessions."], "datePublished": ["2023-07-29T03:49:00.0000000Z", "2023-07-31T01:33:00.0000000Z", "2023-07-29T11:34:00.0000000Z", "2023-07-28T14:46:00.0000000Z", "2023-07-28T08:00:00.0000000Z", "2023-07-26T12:27:00.0000000Z", "2023-07-25T12:19:00.0000000Z", "2023-07-27T23:59:00.0000000Z", "2023-07-21T11:13:00.0000000Z", "2023-07-24T04:03:00.0000000Z"], "url": ["https://finance.yahoo.com/news/broadcom-avgo-smart-long-term-034931336.html", "https://finance.yahoo.com/quote/AVGO230728P00842500/", "https://stocksregister.com/2023/07/29/why-broadcom-inc-nasdaq-avgo-is-a-great-stock-pick-for-momentum-investors/", "https://www.benzinga.com/markets/options/23/07/33444286/this-is-what-whales-are-betting-on-broadcom", "https://www.fool.com/investing/2023/07/28/best-dividend-stock-to-buy-att-stock-vs-broadcom-s/", "https://www.nasdaq.com/articles/avgo-factor-based-stock-analysis-5", "https://www.nasdaq.com/articles/avgo-quantitative-stock-analysis-4", "https://money.usnews.com/investing/stocks/avgo-broadcom-inc/vitals", "https://seekingalpha.com/article/4618484-broadcom-the-gift-that-keeps-on-giving-and-giving-and-giving", "https://newsheater.com/2023/07/24/broadcom-inc-avgo-shares-soar-above-1-year-high/"], "texts": ["Aristotle Atlantic Partners, an investment management firm, released its second quarter 2023 investor letter, a copy of which can be downloaded here. For the second quarter of 2023, Aristotle Atlantic’s Core Equity Composite posted a total return of 9.29 % gross of fees (9.18% net of fees), outperforming the S&P 500 Index, which recorded a total return of 8.74%. Spare some time to check the fund’s top 5 holdings to know more about their top bets for 2023. In its Q2 2023 investor letter, Aristotle Atlantic Partners mentioned Broadcom Inc. (NASDAQ:AVGO) and explained its insights for the company. Founded in", "PR Newswire Broadcom Inc. (NASDAQ: AVGO), a Delaware corporation headquartered in San Jose, CA, and a global technology leader that designs, develops and supplies semiconductor and infrastructure software solutions, today announced it will report its third quarter fiscal year 2023 financial results and business outlook on Thursday, August 31, 2023 after the close of the market. Broadcom's management will host a conference call at 2:00 p.m. Pacific Time on the same day to discuss these results and business o", "Broadcom Inc. (NASDAQ:AVGO) shares, rose in value on Friday, 07/28/23, with the stock price up by 0.70% to the previous day’s close as strong demand from buyers drove the stock to $899.79. Actively observing the price movement in the last trading, the stock closed the session at $893.53, falling within a range of $893.95 and $903.56. The value of beta (5-year monthly) was 1.12 whereas the PE ratio was 28.15 over 12-month period. Referring to stock’s 52-week performance, its high was $923.18, and the low was $415.07. On the whole, AVGO has fluctuated by 6.11% over the past month. Top", "Someone with a lot of money to spend has taken a bearish stance on Broadcom AVGO. And retail traders should know. We noticed this today when the big position showed up on publicly available options history that we track here at Benzinga. Whether this is an institution or just a wealthy individual, we don't know. But when something this big happens with AVGO, it often means somebody knows something is about to happen. So how do we know what this whale just did? Today, Benzinga's options scanner spotted 16 uncommon options trades for Broadcom. This isn't normal. The overall sentiment", "Fool.com contributor Parkev Tatevosian compares AT&T (T) and Broadcom (AVGO -0.63%) on dividend yield, operating profit margin, and forward price-to-earnings ratio to answer which stock is better for passive income investors. *Stock prices used were the afternoon prices of July 25, 2023. The video was published on July 27, 2023.", "Below is Validea's guru fundamental report for BROADCOM INC (AVGO). Of the 22 guru strategies we follow, AVGO rates highest using our Twin Momentum Investor model based on the published strategy of Dashan Huang. This momentum model looks for a combination of fundamental momentum and price momentum. BROADCOM INC (AVGO) is a large-cap growth stock in the Semiconductors industry. The rating using this strategy is 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates", "Below is Validea's guru fundamental report for BROADCOM INC (AVGO). Of the 22 guru strategies we follow, AVGO rates highest using our Twin Momentum Investor model based on the published strategy of Dashan Huang. This momentum model looks for a combination of fundamental momentum and price momentum. BROADCOM INC (AVGO) is a large-cap growth stock in the Semiconductors industry. The rating using this strategy is 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates", "Invested Advice, rankings and one great story every day. Sign Up Sign up to receive the latest updates from U.S. News & World Report and our trusted partners and sponsors. By clicking submit, you are agreeing to our Terms and Conditions & Privacy Policy.", "David Gyung This article was coproduced with Chuck Walston. When my Strong Buy rating on Broadcom (NASDAQ:AVGO) appeared on 10/17/22, the shares traded for $435. I downgraded the stock to a Buy in a follow-up piece published in mid April, and the stock has since soared by about 48%. As I type these words, AVGO trades for $906.61. Broadcom is a beneficiary of the semiconductor boom that is fed by AI, the evolution to 5G, as well as by an improving economy. And as is true of most prospective investments, there are pros and cons regarding AVGO, not the least", "Broadcom Inc. (NASDAQ: AVGO) has seen a rise in its stock price by 0.95 in relation to its previous close of 888.34. However, the company has experienced a 0.92% gain in its stock price over the last five trading sessions. Is It Worth Investing in Broadcom Inc. (NASDAQ: AVGO) Right Now? Broadcom Inc. (NASDAQ: AVGO) has a price-to-earnings ratio of 28.06x that is above its average ratio. Additionally, the 36-month beta value for AVGO is 1.12. There are mixed opinions on the stock, with 17 analysts rating it as a “buy,” 4 rating it as “overweight,” 6 rating it as"], "sentiments": ["neutral", "neutral", "positive", "neutral", "neutral", "neutral", "neutral", "positive", "positive", "positive"], "summaries": ["Core Equity Composite posted a total return of 9.29 % gross of fees. For the second quarter of 2023, Aristotle Atlantic’s Core Equity Composite", "Company to report third quarter fiscal year 2023 financial results and business outlook.", "Strong demand from buyers drove the stock to $899.79.", "Shares of the chipmaker are down more than 20% this year.", "AT&T has a dividend yield of 3.1% while Broadcom has a forward price-to-earnings ratio of 18.", "AVGO is a large-cap growth stock in Semiconductors industry.", "AVGO is a large-cap growth stock in Semiconductors industry.", "FTSE 100 tumbles as Brexit uncertainty grows", "I downgraded the stock to a Buy in mid April, but it has since soared. pros and cons of AVGO, not the least", "The company has seen a rise in its stock price in relation to its previous close of 888.34."]}, "DOCN": {"name": ["DigitalOcean Holdings Inc. (<b>DOCN</b>) Shares Decline Despite Market Challenges", "B of A Securities Maintains DigitalOcean Holdings (<b>DOCN</b>) Buy Recommendation", "A company insider recently sold 6,000 shares of DigitalOcean Holdings Inc. [<b>DOCN</b>]. Should You Sale?", "DigitalOcean Holdings, Inc. (<b>DOCN</b>) Surges 13.4%: Is This an Indication of Further Gains?", "What&#39;s Going On With DigitalOcean Stock Today?", "DigitalOcean (<b>DOCN</b>) Expands AI Footprint With Paperspace Buyout", "DigitalOcean: Deep Value Tech Stock, Pure-Play Cloud Computing Provider", "Longtime tech entrepreneur Anshu Agarwal joins venture firm to ‘let founders do their magic’", "Validea Detailed Fundamental Analysis - <b>DOCN</b>"], "description": ["The stock of DigitalOcean Holdings Inc. (NYSE: DOCN) has decreased by -3.76 when compared to last closing price of 48.74.Despite this, the company has seen a loss of -6.00% in its stock price over the last five trading days.", "Fintel reports that on July 26, 2023, B of A Securities maintained coverage of DigitalOcean Holdings (NYSE:<b>DOCN</b>) with a Buy recommendation. Analyst Price Forecast Suggests 16.29% Downside As of July 6, 2023, the average one-year price target for ...", "As published in a research note from Piper Sandler on June 22, 2023, DigitalOcean Holdings Inc. [DOCN] has been rated down from a Neutral to an Underweight and the price target has been revised to $35. This represents a -32.71% premium over Thursday’s closing price.", "DigitalOcean Holdings, Inc. <b>DOCN</b> shares rallied 13.4% in the last trading session to close at $45.09. This move can be attributable to notable volume with a higher number of shares being traded ...", "DigitalOcean Holdings, Inc. <b>DOCN</b> shares popped Thursday after the company announced it acquired PaperSpace for $111 million in cash. What To Know: Benefits for PaperSpace&#39;s customers will now ...", "DigitalOcean <b>DOCN</b> has made a significant move to expand its artificial intelligence (AI) offerings by acquiring Paperspace, a leading provider of cloud infrastructure as a service, for $111 ...", "It may surprise investors to know that DigitalOcean Holdings, Inc. (NYSE:<b>DOCN</b>), once a high-flying cloud computing stock, is now a value stock. The cloud computing sector has lost some of its ...", "East Coast-based venture-capital firm Converge named Anshu Agarwal as a general partner, thereby establishing a base camp in Silicon Valley.", "Below is Validea&#39;s guru fundamental report for DIGITALOCEAN HOLDINGS INC (<b>DOCN</b>). Of the 22 guru strategies we follow, <b>DOCN</b> rates highest using our P/B Growth Investor model based on the published ..."], "datePublished": ["2023-07-26T17:48:00.0000000Z", "2023-07-26T23:55:00.0000000Z", "2023-07-28T19:48:00.0000000Z", "2023-07-07T17:12:00.0000000Z", "2023-07-06T15:54:00.0000000Z", "2023-07-07T16:34:00.0000000Z", "2023-07-07T20:06:00.0000000Z", "2023-07-21T12:30:00.0000000Z", "2023-07-03T15:24:00.0000000Z"], "url": ["https://newsheater.com/2023/07/26/digitalocean-holdings-inc-docn-shares-decline-despite-market-challenges/", "https://www.msn.com/en-us/money/smallbusiness/b-of-a-securities-maintains-digitalocean-holdings-docn-buy-recommendation/ar-AA1ep1F7", "https://knoxdaily.com/2023/07/28/a-company-insider-recently-sold-6000-shares-of-digitalocean-holdings-inc-docn-should-you-sale/", "https://finance.yahoo.com/news/digitalocean-holdings-inc-docn-surges-141800256.html", "https://www.benzinga.com/news/23/07/33138140/whats-going-on-with-digitalocean-stock-today", "https://finance.yahoo.com/news/digitalocean-docn-expands-ai-footprint-143500556.html", "https://seekingalpha.com/article/4615784-digitalocean-deep-value-tech-stock-pure-play-cloud-computing-provider", "https://www.marketwatch.com/story/longtime-tech-entrepreneur-anshu-agarwal-joins-venture-firm-to-let-founders-do-their-magic-bdd5e686", "https://www.nasdaq.com/articles/validea-detailed-fundamental-analysis-docn"], "texts": ["The stock of DigitalOcean Holdings Inc. (NYSE: DOCN) has decreased by -3.76 when compared to last closing price of 48.74.Despite this, the company has seen a loss of -6.00% in its stock price over the last five trading days. Barron’s reported on 11/07/22 that Digital Ocean Earnings Raise More Questions About the Cloud Is It Worth Investing in DigitalOcean Holdings Inc. (NYSE: DOCN) Right Now? , and the 36-month beta value for DOCN is at 1.20. Analysts have varying views on the stock, with 4 analysts rating it as a “buy,” 1 rating it as “overweight,” 6 as “hold,” and", "", "The buying and selling of stock by a company’s insider give investors a sense that the stock will rise or fall in the future. DigitalOcean Holdings Inc. shares valued at $276,540 were sold by Guy Jeffrey Scott on Jul 10. At $46.09 per share, Guy Jeffrey Scott sold 6,000 shares. The insider’s holdings dropped to 144,262 shares worth approximately $6.7 million following the completion of this transaction. Top 5 AI Stocks to Buy for 2023 The artificial intelligence (AI) revolution is already here. And it's about to change everything we know about everything. According to Grand View Research, the global", "DigitalOcean Holdings, Inc. DOCN shares rallied 13.4% in the last trading session to close at $45.09. This move can be attributable to notable volume with a higher number of shares being traded than in a typical session. This compares to the stock's 6.9% loss over the past four weeks. The upswing in DOCN's can be attributed to the company's expanding AI-based offerings. DigitalOcean's acquisition of Paperspace, a leading provider of cloud infrastructure as a service, will expand clientele. This company is expected to post quarterly earnings of $0.40 per share in its upcoming report, which represents a year-over-year change of", "DigitalOcean Holdings, Inc. DOCN shares popped Thursday after the company announced it acquired PaperSpace for $111 million in cash. What To Know: Benefits for PaperSpace's customers will now include such things as access to a broader cloud services platform, whereas DigitalOcean customers exploring or already building AI/ML applications will now be able to leverage GPUs alongside their CPU workloads. \"We are excited to expand our portfolio tailored to the world's SMBs and startups with simplified AI/ML offerings,\" said Yancey Spruill, CEO of DigitalOcean. \"This acquisition marks a significant milestone in DigitalOcean's journey to revolutionize how SMBs and startups harness the", "DigitalOcean DOCN has made a significant move to expand its artificial intelligence (AI) offerings by acquiring Paperspace, a leading provider of cloud infrastructure as a service, for $111 million in cash. The acquisition allows DigitalOcean to integrate Paperspace's advanced technology into its platform, providing customers with enhanced capabilities for testing, developing, and deploying AI and machine learning (ML) applications. Paperspace brings valuable GPU-powered infrastructure and an AI/ML-focused software stack to DigitalOcean's portfolio, catering to the increasing demand for AI/ML cloud solutions. This acquisition aligns with DigitalOcean's mission to simplify cloud experiences for small and medium-sized businesses (SMBs) and startups. Both", "TU IS It may surprise investors to know that DigitalOcean Holdings, Inc. (NYSE:DOCN), once a high-flying cloud computing stock, is now a value stock. The cloud computing sector has lost some of its shine over the past year, and DOCN is often considered a lower-quality operator in the sector facing stiff competition from the mega-cap tech titans. A tough macro environment has slowed down customer expansion programs, but the company has offset those headwinds through pricing initiatives. Meanwhile, DigitalOcean is generating cash and repurchasing stock. It is unclear how the rise of artificial intelligence, or AI, may impact the cloud", "Longtime Silicon Valley entrepreneur Anshu Agarwal has decided it’s time to be a mentor rather than an operator. In 2021, DigitalOcean Holdings Inc. DOCN, +2.57% acquired Agarwal’s cloud company, Nimbella, the fifth startup in her portfolio of nearly two decades. After serving as vice president and general manager of DigitalOcean’s Serverless & Kubernetes business unit, elevating DigitalOcean to more than 600,000 customers, she was ready for a change. “When I left DigitalOcean, I could have started another company or joined an established one,” Agarwal said in an interview. “I know what founders want after years as an operator.” On Thursday,", "Below is Validea's guru fundamental report for DIGITALOCEAN HOLDINGS INC (DOCN). Of the 22 guru strategies we follow, DOCN rates highest using our P/B Growth Investor model based on the published strategy of Partha Mohanram. This growth model looks for low book-to-market stocks that exhibit characteristics associated with sustained future growth. DIGITALOCEAN HOLDINGS INC (DOCN) is a mid-cap value stock in the Software & Programming industry. The rating using this strategy is 77% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock"], "sentiments": ["negative", "positive", "neutral", "positive", "positive", "positive", "positive", "positive", "positive"], "summaries": ["Company has seen a loss of -6.00% in its stock price over the last five trading days.", "All photographs subject to copyright.", "Guy Jeffrey Scott sold 6,000 shares at $46.09 per share.", "Shares of DigitalOcean have gained 13.4% in the last trading session.", "DigitalOcean said it acquired PaperSpace for $111 million in cash.", "Acquires Paperspace, a leading provider of cloud infrastructure as a service.", "DigitalOcean is a lower-quality operator in the sector. The company is generating cash, returning it to shareholders", "DigitalOcean acquired Agarwal’s Nimbella in 2021", "DocN is a mid-cap value stock in the Software & Programming industry."]}, "IBM": {"name": ["National Beat: <b>IBM</b>&#39;s startup shopping spree, AI jobs and new startups to watch", "What Are You Thinking About Investing In International Business Machines Corporation (NYSE: <b>IBM</b>) Stock?", "Check Out What Whales Are Doing With <b>IBM</b>", "International Business Machines Corporation (<b>IBM</b>) Stock: A Look at the Analyst Recommendations", "Is It Time to Buy <b>IBM</b> Stock After a Solid Earnings Report?", "Inside <b>IBM</b> Storage’s Fusion and watsonx.data technology", "<b>IBM</b> Unveils Tool to Help Companies Measure Sustainability Objectives", "Unlocking data value with AI: How <b>IBM</b> is shaping the future of data storage", "<b>IBM</b> and NABP Partner to Create Digital Platform to Protect the Drug Supply Chain", "<b>IBM</b> Cloud Carbon Calculator: Enabling Environmental Goals"], "description": ["In the latest National Beat, we&#39;re looking at the top cities for AI jobs, the founder of Whole Foods&#39; next gig, and new startups to watch.", "International Business Machines Corporation (NYSE:IBM) traded at $143.45 at close of the session on Monday, July 31, made an upward move of 0.34% on its previous day’s price. Looking at the stock we see that its previous close was $142.", "Taking into account the Volume and Open Interest on these contracts, it appears that whales have been targeting a price range from $60.0 to $150.0 for IBM over the last 3 months. Looking at the volume and open interest is an insightful way to conduct due diligence on a stock.", "International Business Machines Corporation (NYSE: IBM) has a higher price-to-earnings ratio of 69.94x compared to its average ratio. compared to its average ratio and a 36-month beta value of 0.85. Analysts have mixed views on the stock,", "OpenShift is now at a $1.1 billion annual recurring revenue run rate, but that&#39;s not the only way IBM leverages its acquisition of Red Hat. Within the consulting segment, IBM has built a multibillion-dollar consulting business around Red Hat&#39;s hybrid cloud platform.", "IBM’s new watsonx.data has incorporated more innovations and supports multiple engines. As a result, enterprises are provided with consistent performance, given that they can query any data anywhere at any given time, according to Hsu.", "IBM is introducing a new tool to help enterprises track greenhouse gas (GHG) emissions across cloud services along with the ability to advance sustainability performance throughout the hybrid, multi-cloud journey.", "AI is playing a pivotal role in reshaping the storage landscape, according to Werner and Baker. IBM is at the forefront of operationalizing AI within its storage products. The implementation of AIOps simplifies storage infrastructure management, ensuring uptime and preventing disruptions.", "IBM Consulting is collaborating with the National Association of Boards of Pharmacy (NABP) to build Pulse by NABP, a new digital platform that is intended to bring visibility to the drug supply chain and help protect patients from counterfeit or substandard prescription medications.", "The new IBM Cloud Carbon Calculator serves customers leveraging cloud for workloads, including artificial intelligence and high-performance computing."], "datePublished": ["2023-07-31T18:30:00.0000000Z", "2023-07-31T16:39:00.0000000Z", "2023-07-31T17:45:00.0000000Z", "2023-07-31T07:19:00.0000000Z", "2023-07-25T10:50:00.0000000Z", "2023-07-26T21:26:00.0000000Z", "2023-07-31T13:11:00.0000000Z", "2023-07-26T21:07:00.0000000Z", "2023-07-31T13:11:00.0000000Z", "2023-07-26T21:34:00.0000000Z"], "url": ["https://www.bizjournals.com/newyork/news/2023/07/31/national-beat-ai-jobs-startups.html", "https://stocksregister.com/2023/07/31/what-are-you-thinking-about-investing-in-international-business-machines-corporation-nyse-ibm-stock/", "https://www.benzinga.com/markets/options/23/07/33476037/check-out-what-whales-are-doing-with-ibm", "https://newsheater.com/2023/07/31/international-business-machines-corporation-ibm-stock-a-look-at-the-analyst-recommendations/", "https://www.fool.com/investing/2023/07/25/is-it-time-to-buy-ibm-stock-after-a-solid-earnings/", "https://siliconangle.com/2023/07/26/inside-ibm-storages-fusion-watsonx-data-technology-ibmstoragesummit/", "https://www.dbta.com/Editorial/News-Flashes/IBM-Unveils-Tool-to-Help-Companies-Measure-Sustainability-Objectives-159845.aspx", "https://siliconangle.com/2023/07/26/unlocking-data-value-ai-ibm-shaping-future-data-storage-ibmstoragesummit/", "https://www.dbta.com/Editorial/News-Flashes/IBM-and-NABP-Partner-to-Create-Digital-Platform-to-Protect-the-Drug-Supply-Chain-159839.aspx", "https://www.eweek.com/cloud/ibm-cloud-carbon-calculator/"], "texts": [" ", "International Business Machines Corporation (NYSE:IBM) traded at $143.45 at close of the session on Monday, July 31, made an upward move of 0.34% on its previous day’s price. Looking at the stock we see that its previous close was $142.97 with the day’s price range being $142.85 – $143.95. The company has a trailing 12-month PE ratio of 69.94. In terms of its 52-week price range, IBM has a high of $153.21 and a low of $115.54. The company’s stock has gained about 8.87% over that past 30 days. Top 5 AI Stocks to Buy for 2023 The artificial intelligence", "A whale with a lot of money to spend has taken a noticeably bearish stance on IBM. Looking at options history for IBM IBM we detected 16 strange trades. If we consider the specifics of each trade, it is accurate to state that 25% of the investors opened trades with bullish expectations and 75% with bearish. From the overall spotted trades, 5 are puts, for a total amount of $168,156 and 11, calls, for a total amount of $981,383. What's The Price Target? Taking into account the Volume and Open Interest on these contracts, it appears that whales have been", "International Business Machines Corporation (NYSE: IBM) has a higher price-to-earnings ratio of 69.94x compared to its average ratio. compared to its average ratio and a 36-month beta value of 0.85. Analysts have mixed views on the stock, with 5 analysts rating it as a “buy,” 0 as “overweight,” 12 as “hold,” and 1 as “sell.” The average price point forecasted by analysts for International Business Machines Corporation (IBM) is $145.73, which is $0.3 above the current market price. The public float for IBM is 910.15M, and currently, short sellers hold a 2.81% ratio of that float. The average trading volume", "On the surface, International Business Machines' (IBM 0.17%) second-quarter earnings report was a mixed bag. While the century-old tech giant beat analyst expectations for profit, a slight revenue decline came up short of what analysts were expecting in the July 19 report. Under the surface, IBM's results paint a picture of a company making solid progress. The revenue decline was due solely to the hardware business and the product life cycle dynamics of the company's mainframe business. Both software and consulting posted strong growth, and IBM stuck with its guidance for the full year. The AI opportunity IBM has put", " ", "IBM is introducing a new tool to help enterprises track greenhouse gas (GHG) emissions across cloud services along with the ability to advance sustainability performance throughout the hybrid, multi-cloud journey. Now generally available, the IBM Cloud Carbon Calculator—an AI-informed dashboard—can help clients access emissions data across a variety of IBM Cloud workloads such as AI, high performance computing (HPC), and financial services. The IBM Cloud Carbon Calculator is designed to quickly spot patterns, anomalies, and outliers in data that are potentially associated with higher GHG emissions. Based on technology from IBM Research and through a collaboration with Intel, the tool", " ", "IBM Consulting is collaborating with the National Association of Boards of Pharmacy (NABP) to build Pulse by NABP, a new digital platform that is intended to bring visibility to the drug supply chain and help protect patients from counterfeit or substandard prescription medications. Launching in late summer 2023, the platform is designed to facilitate manufacturers, wholesalers, pharmacies, and regulators to identify counterfeit or substandard prescription medications and connect with each other when required; provide authorized partners with capabilities to help them accurately trace prescription medications throughout the supply chain; and give patients more confidence that their prescriptions are legitimate. Pulse", "eWEEK content and product recommendations are editorially independent. We may make money when you click on links to our partners. Learn More. With much of the U.S. and many other parts of the world suffering record temperatures and other extreme weather events, it’s worth considering efforts that companies are making to reduce carbon and other emissions as part of their Environmental, Sustainability and Governance (ESG) strategies. Yet the increasing role that energy-intensive cloud computing plays in numerous business and consumer services, as well as burgeoning new opportunities, including training generative AI platforms, is leaving many businesses wondering how they can"], "sentiments": ["positive", "neutral", "negative", "positive", "positive", "positive", "positive", "positive", "positive", "positive"], "summaries": ["All photographs subject to copyright.", "Shares of the company have gained about 8.87% over the past 30 days.", "Whales have taken a bearish stance on the stock.", "International Business Machines Corporation (IBM) is trading at a P/E ratio of 69.94x.", "Software and consulting divisions posted strong growth. Revenue decline was due solely to hardware business", "All photographs subject to copyright.", "New tool can help enterprises track greenhouse gas emissions. AI-informed dashboard can help clients understand their impact on the environment", "All photographs subject to copyright.", "Platform designed to facilitate manufacturers, wholesalers, pharmacies, and regulators.", "Energy-intensive cloud computing plays a growing role."]}, "MSFT": {"name": ["Microsoft: Another Solid Quarter, But <b>MSFT</b> Stock Is Still A Sell", "&quot;Microsoft: The Third Pillar&quot; (The Emerging Opportunity For <b>MSFT</b> From Generative AI)", "Microsoft Corporation (<b>MSFT</b>) Stock: Analyzing the Quarterly Movement", "Did Microsoft (<b>MSFT</b>) Stock Just Peak?", "Oppenheimer Reiterates Microsoft (<b>MSFT</b>) Outperform Recommendation", "GOOGL &amp; <b>MSFT</b> Earnings: A Tale of Two Tech Titans", "L1 Capital International Fund: “Microsoft Corporation (<b>MSFT</b>) is a Clear and Substantial Beneficiary of AI”", "<b>MSFT</b> CY23Q2 Results are in"], "description": ["Summary Despite reporting a solid double beat for Q4 FY23, Microsoft&#39;s stock has tumbled by ~6% over the last few sessions after FY24 guidance failed to meet lofty investor expectations.Even at ~$335 per share,", "Office revenues reached ~$49 billion in FY2023 (up ~70% from FY2018); Office 365 Commercial now has ~400 million paid seats, up &gt;100% from yearend FY2018. Ongoing strength in paid seats (volumes), at +11% YoY in Q4 FY2023,", "MSFT stock has gone down by -1.57%, with a monthly gain of 0.75% and a quarterly surge of 11.00%. The volatility ratio for the week is 2.52%, and the volatility levels for the last 30 days are 2.37% for Microsoft Corporation The simple moving average for the last 20 days is -0.", "InvestorPlace - Stock Market News, Stock Advice &amp; Trading Tips Microsoft (NASDAQ:MSFT), a tech giant globally known for its robust portfolio", "Fintel reports that on July 28, 2023, Oppenheimer reiterated coverage of Microsoft (NASDAQ:MSFT) with a Outperform recommendation. Analyst Price Forecast Suggests 3.56% Upside As of July 5, 2023, the average one-year price target for Microsoft is 350.", "InvestorPlace - Stock Market News, Stock Advice &amp; Trading Tips It was a tale of two cities – or, in this case, a tale of two tech", "L1 Capital, an investment management firm, released its “L1 Capital International Fund” second quarter 2023 investor letter, a copy of the same can be downloaded here. In the June 2023 quarter, the fund returned 9.", "I wanted to say this was kind of a meh quarter, but really, it&#39;s not - Revenue up 8% and profit up 20(!)% y/y. All the usual business are killing it, though Azure growth slowed to a paltry 26% y/y ..."], "datePublished": ["2023-07-31T12:30:00.0000000Z", "2023-07-31T15:44:00.0000000Z", "2023-07-31T07:56:00.0000000Z", "2023-07-26T19:26:00.0000000Z", "2023-07-29T03:01:59.0000000Z", "2023-07-26T14:41:00.0000000Z", "2023-07-27T11:19:00.0000000Z", "2023-07-29T15:54:00.0000000Z"], "url": ["https://www.msn.com/en-us/money/markets/microsoft-another-solid-quarter-but-msft-stock-is-still-a-sell/ar-AA1eAAPz", "https://www.benzinga.com/23/07/33473086/microsoft-the-third-pillar-the-emerging-opportunity-for-msft-from-generative-ai", "https://newsheater.com/2023/07/31/microsoft-corporation-msft-stock-analyzing-the-quarterly-movement-2/", "https://markets.businessinsider.com/news/stocks/did-microsoft-msft-stock-just-peak-1032481225", "https://www.msn.com/en-us/money/savingandinvesting/oppenheimer-reiterates-microsoft-msft-outperform-recommendation/ar-AA1evxWT", "https://markets.businessinsider.com/news/stocks/googl-msft-earnings-a-tale-of-two-tech-titans-1032480579", "https://finance.yahoo.com/news/l1-capital-international-fund-microsoft-111923760.html", "https://arstechnica.com/civis/threads/msft-cy23q2-results-are-in.1494806/"], "texts": ["", "Microsoft MSFT Office revenues reached ~$49 billion in FY2023 (up ~70% from FY2018); Office 365 Commercial now has ~400 million paid seats, up >100% from yearend FY2018. Ongoing strength in paid seats (volumes), at +11% YoY in Q4 FY2023, was led by SMB’s and frontline workers. In addition, Microsoft is seeing continued success with it’s higher value offerings (and with the effective implementation of the March 2022 price increases); Office 365 revenues have outgrown paid seats in every quarter for the past 5+ years. (On the Q4 FY2022 call, management said E5 accounted for ~12% of the Office 365 Commercial", "In the past week, MSFT stock has gone down by -1.57%, with a monthly gain of 0.75% and a quarterly surge of 11.00%. The volatility ratio for the week is 2.52%, and the volatility levels for the last 30 days are 2.37% for Microsoft Corporation The simple moving average for the last 20 days is -0.99% for MSFT stock, with a simple moving average of 22.36% for the last 200 days. Is It Worth Investing in Microsoft Corporation (NASDAQ: MSFT) Right Now? Microsoft Corporation (NASDAQ: MSFT) has a price-to-earnings ratio of 34.94x that is above its average ratio. Additionally, the", "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Microsoft (NASDAQ:MSFT), a tech giant globally known for its robust portfolio of services and products, has had a remarkable surge in its performance. We’ve all heard about the “Magnificent 7,” and it’s clear that MSFT stock owners have meaningfully outperformed relative to the S&P 500. Source: Chart courtesy of StockCharts.com Microsoft’s financial health has been consistently robust, with the company posting some of its highest-ever financial metrics in recent quarters. In the three-month period ending June 30, the company posted $56.2 billion in sales and $2.69 earnings per share, smashing", "", "InvestorPlace - Stock Market News, Stock Advice & Trading Tips It was a tale of two cities – or, in this case, a tale of two tech titans and their summer earnings reports. Last night, Alphabet (GOOGL) absolutely crushed estimates, and GOOGL stock jumped in response. Microsoft (MSFT), on the other hand, delivered mixed results. And MSFT stock dropped as a result. Does that mean GOOGL stock is a great buy and MSFT stock is a sell here? Hardly. Both are fantastic long-term investment opportunities for one very simple reason: the AI Boom. It’s clear we are entering the Age", "L1 Capital, an investment management firm, released its “L1 Capital International Fund” second quarter 2023 investor letter, a copy of the same can be downloaded here. In the June 2023 quarter, the fund returned 9.0% (net of fees) outperforming the benchmark's (MSCI World Net Total Return Index in AUD) 7.5% return. The Fund and Benchmark’s Australian dollar reported quarterly returns increased as AUD depreciated 1.0% against the U.S. dollar and depreciated 0.9% against the Euro. The Fund returned 25.5% (net of fees), outperforming the Benchmark’s return of 22.4% by 3.1% (all in Australian dollars) for the year ended 30 June", "I wanted to say this was kind of a meh quarter, but really, it's not - Revenue up 8% and profit up 20(!)% y/y. All the usual business are killing it, though Azure growth slowed to a paltry 26% y/y. More personal computing was not so great though, as Windows OEM revenue dropped 12% and Devices dropped 20%. So, all in all pretty solid. Next quarter is probably less interesting now that the ATVI deal has been pushed out to Q4, but I guess we might see some if the AI craze showing up in the numbers."], "sentiments": ["positive", "positive", "negative", "positive", "positive", "positive", "neutral", "positive"], "summaries": ["All photographs subject to copyright.", "Office 365 Commercial now has 400 million paid seats. SMB, frontline workers driving growth in paid seats.", "Microsoft Corporation (: MSFT) stock is trading at a P/E ratio of 34.94x.", "Tech giant posted record quarterly sales, earnings per share. MSFT stock has outperformed the S&P 500 this year", "All photographs subject to copyright.", "Alphabet crushed estimates, but Microsoft’s results were mixed.", "L1 Capital International Fund returned 9.0% (net of fees) in the June 2023 quarter.", "Tech giant reports better-than-expected results, driven by usual businesses. Next quarter seen less interesting now that ATVI deal has been pushed out"]}, "TXN": {"name": ["$100 Invested In Texas Instruments 20 Years Ago Would Be Worth This Much Today", "Should You Invest in Texas Instruments Incorporated (<b>TXN</b>) Now?", "Texas Instruments Incorporated (NASDAQ: <b>TXN</b>): What Matters Now", "4 Analysts On Texas Instruments&#39; Q2 Print: &#39;Nearer Term, Results Were Better,&#39; Q3 &#39;Expected To Be Flat&#39;", "Texas Instruments’ stock slips as continued capacity buildout amid growing inventory weighs on outlook", "Texas Instruments (<b>TXN</b>) Gets a Buy from DBS", "Texas Instruments (<b>TXN</b>) Declares $1.24 Dividend", "<b>TXN</b> Factor-Based Stock Analysis - Warren Buffett", "Texas Instruments (<b>TXN</b>) Declares $1.24 Dividend"], "description": ["Texas Instruments TXN has outperformed the market over the past 20 years by 4.12% on an annualized basis producing an average annual return of 12.12%. Currently, Texas Instruments has a market capitalization of $162.", "Texas Instruments Incorporated (NASDAQ: TXN) has a higher price-to-earnings ratio of 21.41x compared to its average ratio,, and the 36-month beta value for TXN is at 1.01. Analysts have varying views on the stock,", "Texas Instruments Incorporated (NASDAQ:TXN) shares, rose in value on Friday, 07/28/23, with the stock price up by 0.37% to the previous day’s close as strong demand from buyers drove the stock to $178.", "Shares of Texas Instruments Inc (NASDAQ: TXN) tanked in early trading on Wednesday, after a steep decline in the previous session.", "Texas Instruments Inc. shares fell in the extended session Tuesday after the chip maker&#39;s outlook overshadowed its earnings beat.", "DBS analyst Ling Lee Keng maintained a Buy rating on Texas Instruments (TXN – Research Report) yesterday and set a price target of", "This is an increase of 13 owner(s) or 0.37% in the last quarter. Average portfolio weight of all funds dedicated to <b>TXN</b> is 0.65%, an increase of 7.85%. Total shares owned by institutions decreased in the last three months by 0.21% to 889,965K shares.", "Below is Validea&#39;s guru fundamental report for TEXAS INSTRUMENTS INC (<b>TXN</b>). Of the 22 guru strategies we follow, <b>TXN</b> rates highest using our Patient Investor model based on the published strategy ...", "Texas Instruments said on July 20, 2023 that its board of directors declared a regular quarterly dividend of $1.24 per share ($4.96 annualized). Previously, the company paid $1.24 per share ..."], "datePublished": ["2023-07-31T16:29:00.0000000Z", "2023-07-31T03:16:00.0000000Z", "2023-07-29T15:42:00.0000000Z", "2023-07-26T18:43:00.0000000Z", "2023-07-26T11:54:00.0000000Z", "2023-07-27T05:55:00.0000000Z", "2023-07-25T17:17:00.0000000Z", "2023-07-26T13:21:00.0000000Z", "2023-07-25T18:05:00.0000000Z"], "url": ["https://www.benzinga.com/news/earnings/23/07/33474688/100-invested-in-texas-instruments-20-years-ago-would-be-worth-this-much-today", "https://newsheater.com/2023/07/31/should-you-invest-in-texas-instruments-incorporated-txn-now/", "https://stocksregister.com/2023/07/29/texas-instruments-incorporated-nasdaq-txn-what-matters-now/", "https://markets.businessinsider.com/news/stocks/4-analysts-on-texas-instruments-q2-print-nearer-term-results-were-better-q3-expected-to-be-flat-1032480906", "https://www.marketwatch.com/story/texas-instruments-stock-slips-as-outlook-overshadows-earnings-beat-4cd6e59", "https://markets.businessinsider.com/news/stocks/texas-instruments-txn-gets-a-buy-from-dbs-1032482735", "https://www.msn.com/en-us/money/taxes/texas-instruments-txn-declares-1-24-dividend/ar-AA1eljz4", "https://www.nasdaq.com/articles/txn-factor-based-stock-analysis-warren-buffett-4", "https://www.nasdaq.com/articles/texas-instruments-txn-declares-$1.24-dividend-0"], "texts": ["Texas Instruments TXN has outperformed the market over the past 20 years by 4.12% on an annualized basis producing an average annual return of 12.12%. Currently, Texas Instruments has a market capitalization of $162.93 billion. Buying $100 In TXN: If an investor had bought $100 of TXN stock 20 years ago, it would be worth $983.29 today based on a price of $179.45 for TXN at the time of writing. Texas Instruments's Performance Over Last 20 Years Finally -- what's the point of all this? The key insight to take from this article is to note how much of a", "Texas Instruments Incorporated (NASDAQ: TXN) has a higher price-to-earnings ratio of 21.41x compared to its average ratio,, and the 36-month beta value for TXN is at 1.01. Analysts have varying views on the stock, with 9 analysts rating it as a “buy,” 1 rating it as “overweight,” 20 as “hold,” and 3 as “sell.” The average price suggested by analysts for TXN is $186.38, which is $5.57 above the current market price. The public float for TXN is 906.08M, and currently, shorts hold a 1.75% of that float. The average trading volume for TXN on July 31, 2023 was 5.30M", "Texas Instruments Incorporated (NASDAQ:TXN) shares, rose in value on Friday, 07/28/23, with the stock price up by 0.37% to the previous day’s close as strong demand from buyers drove the stock to $178.37. Actively observing the price movement in the last trading, the stock closed the session at $177.72, falling within a range of $176.93 and $179.53. The value of beta (5-year monthly) was 1.01 whereas the PE ratio was 20.02 over 12-month period. Referring to stock’s 52-week performance, its high was $188.12, and the low was $145.97. On the whole, TXN has fluctuated by 1.95% over the past month.", "Shares of Texas Instruments Inc (NASDAQ:TXN) tanked in early trading on Wednesday, after a steep decline in the previous session. The company reported upbeat second-quarter results on auto chip sales, amid an exciting earnings season. Here are some key analyst takeaways from the earnings release. Susquehanna On Texas Instruments Analyst Christopher Rolland reiterated a Positive rating, while lifting the price target from $205 to $215. “TI reported better 2Q results driven by stronger Automotive, Industrial and PE,” Rolland said in a note. He added, that the company’s “bottom-line guidance implies a disappointing gross margin, down more than -150 basis points", "Texas Instruments Inc. shares fell further in the extended session Tuesday after the chip maker’s outlook overshadowed its earnings beat, and the company said it would continue building out capacity even as inventory levels rose. Texas Instruments shares TXN, +0.91% fell 3.3% in after-hours trading, after closing the regular session Tuesday up 1.2% at $186.08. Tuesday’s earnings report marked the third consecutive quarter of declining year-over-year profits and revenue at Texas Instruments, and analysts are forecasting another two quarters of the same before an estimated return to growth. That said, analysts on the call questioned whether the company was on", "DBS analyst Ling Lee Keng maintained a Buy rating on Texas Instruments (TXN – Research Report) yesterday and set a price target of $204.20. The company’s shares closed yesterday at $176.00. According to TipRanks, Lee Keng is a 3-star analyst with an average return of 2.7% and a 31.58% success rate. Lee Keng covers the Technology sector, focusing on stocks such as Venture, Advanced Micro Devices, and Nvidia. Currently, the analyst consensus on Texas Instruments is a Hold with an average price target of $184.55, implying a 4.86% upside from current levels. In a report released yesterday, Jefferies also maintained", "", "Below is Validea's guru fundamental report for TEXAS INSTRUMENTS INC (TXN). Of the 22 guru strategies we follow, TXN rates highest using our Patient Investor model based on the published strategy of Warren Buffett. This strategy seeks out firms with long-term, predictable profitability and low debt that trade at reasonable valuations. TEXAS INSTRUMENTS INC (TXN) is a large-cap growth stock in the Semiconductors industry. The rating using this strategy is 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a", "Texas Instruments said on July 20, 2023 that its board of directors declared a regular quarterly dividend of $1.24 per share ($4.96 annualized). Previously, the company paid $1.24 per share. Shares must be purchased before the ex-div date of July 28, 2023 to qualify for the dividend. Shareholders of record as of July 31, 2023 will receive the payment on August 15, 2023. At the current share price of $183.89 / share, the stock's dividend yield is 2.70%. Looking back five years and taking a sample every week, the average dividend yield has been 2.72%, the lowest has been 2.07%,"], "sentiments": ["positive", "positive", "positive", "positive", "negative", "positive", "positive", "neutral", "positive"], "summaries": ["Texas Instruments has outperformed the market over the past 20 years.", "Shares of Texas Instruments are trading at a P/E ratio of 21.41x.", "Texas Instruments Incorporated (TXN) shares up by 0.37% to previous day’s close.", "Susquehanna lifts price target on shares to $215.", "Analysts question whether company is on track to return to growth. Texas Instruments says it will continue building out capacity", "Lee Keng covers the Technology sector.", "All photographs subject to copyright.", "INSTRU INC is a large-cap growth stock in Semiconductors industry.", "Dividend payment of $1.24 per share to be paid on August 15, 2023."]}}