{"name": ["Selling Buzz: DigitalOcean Holdings Inc. [<b>DOCN</b>] Chief People Officer Norman Harold Matthew sells 10,000 shares of the company", "Is It Time To Consider Buying DigitalOcean Holdings, Inc. (NYSE:<b>DOCN</b>)?", "DigitalOcean (NYSE: <b>DOCN</b>)", "Are Computer and Technology Stocks Lagging DigitalOcean (<b>DOCN</b>) This Year?", "DigitalOcean Holdings Inc.’s (<b>DOCN</b>) Stock: A Long-Term Performance Analysis", "DigitalOcean Holdings Inc (<b>DOCN</b>) is down 4.17% Tuesday In Premarket Trading", "DigitalOcean Holdings Inc.’s (<b>DOCN</b>) Stock: A 16.89% Simple Moving Average for the Past 20 Days", "Notable Wednesday Option Activity: MSTR, SRPT, <b>DOCN</b>"], "description": ["Before that, Norman Harold Matthew had sold 21,499 shares from its account. In a trade valued at $731,611, the Chief People Officer traded DigitalOcean Holdings Inc. shares for $34.03 each. Upon closing the transaction, the insider’s holdings decreased to 21,499 shares, worth approximately $6.23 million.", "DigitalOcean Holdings, Inc. ( NYSE:DOCN ), is not the largest company out there, but it saw a significant share", "Businesses grow faster when developers can build on the simple, affordable cloud they love. DigitalOcean has cloud computing services with predictable pricing, robust documentation, and ...", "Has DigitalOcean Holdings, Inc. (<b>DOCN</b>) been one of those stocks this year? Let&#39;s take a closer look at the stock&#39;s year-to-date performance to find out. DigitalOcean Holdings, Inc. is one of 642 ...", "The stock of DigitalOcean Holdings Inc. (DOCN) has gone up by 21.85% for the week, with a 36.67% rise in the past month and a 25.29% rise in the past quarter. The volatility ratio for the week is 4.77%,", "<b>DOCN</b>&#39;s short-term technical score of 36 indicates that the stock has traded less bullishly over the DigitalOcean Holdings Inc (<b>DOCN</b>) is down Tuesday morning, with the stock losing -4.17% in pre ...", "The stock of DigitalOcean Holdings Inc. (DOCN) has gone up by 12.89% for the week, with a 23.42% rise in the past month and a 23.31% rise in the past quarter. The volatility ratio for the week is 4.93%,", "Below is a chart showing SRPT&#39;s trailing twelve month trading history, with the $150 strike highlighted in orange: And DigitalOcean Holdings Inc (Symbol: <b>DOCN</b>) options are showing a volume of ..."], "datePublished": ["2023-06-09T19:29:00.0000000Z", "2023-06-02T16:47:00.0000000Z", "2023-06-09T11:32:00.0000000Z", "2023-05-16T00:35:00.0000000Z", "2023-06-06T17:59:00.0000000Z", "2023-04-26T04:16:00.0000000Z", "2023-06-01T03:57:00.0000000Z", "2023-05-24T19:39:00.0000000Z"], "url": ["https://knoxdaily.com/2023/06/09/selling-buzz-digitalocean-holdings-inc-docn-chief-people-officer-norman-harold-matthew-sells-10000-shares-of-the-company/", "https://finance.yahoo.com/news/time-consider-buying-digitalocean-holdings-164704703.html", "https://www.fool.com/quote/nyse/docn/", "https://finance.yahoo.com/news/computer-technology-stocks-lagging-digitalocean-134001193.html", "https://newsheater.com/2023/06/06/digitalocean-holdings-inc-s-docn-stock-a-long-term-performance-analysis/", "https://www.benzinga.com/content/www-investorsobserver-com/23/04/31984867/digitalocean-holdings-inc-docn-is-down-4-17-tuesday-in-premarket-trading", "https://newsheater.com/2023/06/01/digitalocean-holdings-inc-s-docn-stock-a-16-89-simple-moving-average-for-the-past-20-days/", "https://www.nasdaq.com/articles/notable-wednesday-option-activity:-mstr-srpt-docn"], "texts": ["The buying and selling of stock by a company’s insider give investors a sense that the stock will rise or fall in the future. DigitalOcean Holdings Inc. shares valued at $450,000 were sold by Norman Harold Matthew on Jun 06. At $45.00 per share, Norman Harold Matthew sold 10,000 shares. The insider’s holdings dropped to 129,890 shares worth approximately $5.56 million following the completion of this transaction. 25-cent Stock Takes $11T Commodities Sector Digital One brilliantly-run technology firm has successfully partnered with some of the largest players in the industry to bring a first-of-its-kind digital solution to the global commodities", "DigitalOcean Holdings, Inc. (NYSE:DOCN), is not the largest company out there, but it saw a significant share price rise of over 20% in the past couple of months on the NYSE. With many analysts covering the mid-cap stock, we may expect any price-sensitive announcements have already been factored into the stock’s share price. However, could the stock still be trading at a relatively cheap price? Let’s take a look at DigitalOcean Holdings’s outlook and value based on the most recent financial data to see if the opportunity still exists. Check out our latest analysis for DigitalOcean Holdings What's The Opportunity", "Investors might want to grab these stocks while they're trading at a heavy discount. 2 Super Stocks Down 67% and 87% You'll Regret Not Buying on the Dip Featured Article This Magnificent Growth Stock Could Jump Another 71%, and It Is a Bargain Right Now Investors looking to buy growth that isn't too expensive should take a closer look at cloud player DigitalOcean. Harsh Chauhan | Jun 1, 2023", "For those looking to find strong Computer and Technology stocks, it is prudent to search for companies in the group that are outperforming their peers. Has DigitalOcean Holdings, Inc. (DOCN) been one of those stocks this year? Let's take a closer look at the stock's year-to-date performance to find out. DigitalOcean Holdings, Inc. is one of 642 companies in the Computer and Technology group. The Computer and Technology group currently sits at #13 within the Zacks Sector Rank. The Zacks Sector Rank gauges the strength of our 16 individual sector groups by measuring the average Zacks Rank of the individual", "The stock of DigitalOcean Holdings Inc. (DOCN) has gone up by 21.85% for the week, with a 36.67% rise in the past month and a 25.29% rise in the past quarter. The volatility ratio for the week is 4.77%, and the volatility levels for the past 30 days are 4.43% for DOCN. The simple moving average for the last 20 days is 27.20% for DOCN’s stock, with a simple moving average of 33.21% for the last 200 days. Is It Worth Investing in DigitalOcean Holdings Inc. (NYSE: DOCN) Right Now? Analysts have mixed views on the stock, with 4 analysts", "DigitalOcean Holdings Inc (DOCN) is down Tuesday morning, with the stock losing -4.17% in pre-market trading to 31.5. DOCN's short-term technical score of 36 indicates that the stock has traded less bullishly over the last month than 64% of stocks on the market. In the Software - Infrastructure industry, which ranks 116 ou", "The stock of DigitalOcean Holdings Inc. (DOCN) has gone up by 12.89% for the week, with a 23.42% rise in the past month and a 23.31% rise in the past quarter. The volatility ratio for the week is 4.93%, and the volatility levels for the past 30 days are 4.37% for DOCN. The simple moving average for the past 20 days is 16.89% for DOCN’s stock, with a 15.81% simple moving average for the past 200 days. Is It Worth Investing in DigitalOcean Holdings Inc. (NYSE: DOCN) Right Now? There are mixed opinions on the stock, with 4 analysts rating", "Looking at options trading activity among components of the Russell 3000 index, there is noteworthy activity today in MicroStrategy Inc. (Symbol: MSTR), where a total volume of 15,139 contracts has been traded thus far today, a contract volume which is representative of approximately 1.5 million underlying shares (given that every 1 contract represents 100 underlying shares). That number works out to 171.6% of MSTR's average daily trading volume over the past month, of 882,195 shares. Particularly high volume was seen for the $300 strike call option expiring May 26, 2023, with 1,013 contracts trading so far today, representing approximately 101,300"], "sentiments": ["positive", "neutral", "positive", "positive", "positive", "negative", "positive", "neutral"]}