{"name": ["Endicott&#39;s history stretches from E-J to <b>IBM</b>: Take a walk back in time", "<b>IBM</b> to build its first European quantum data center", "Revolutionizing Business Intelligence for the <b>IBM</b> i: Introducing LANSA BI", "<b>IBM</b> leasing offices that CommerceHub vacated at Albany Nanotech ZEN Building", "<b>IBM</b>: Buy For The 5% Dividend, Hold For The AI Upside", "Secure and Integrated Banking: Stanbic Uganda Partners with <b>IBM</b>", "Knydryl&#39;s CFO on the strategy that propelled the <b>IBM</b> spinoff onto the Fortune 500, boosted revenue, and saved millions", "<b>IBM</b> to Showcase Open Analytics Push at PrestoCon Day", "<b>IBM</b> Can Use Kirkland in Copyright Fight With Other Firm Client", "<b>IBM</b> on AI—enterprises want ‘more curated’ solutions"], "description": ["As Endicott tries to find its way back to vitality, a walking tour will provide a glimpse of the old factory village, from E-J to IBM.", "IBM announced plans to open its first Europe-based quantum data center to facilitate access to cutting-edge quantum computing for companies, research institutions and government agencies. The data center is expected to be operational in 2024,", "LANSA, a leading provider of IBM i modernization solutions, has introduced LANSA BI, a developer toolkit for standalone or embedded business intelligence built on native DB2 integration. In collaborat", "IBM will increase its presence in the Albany region by leasing the top floor of the ZEN Building at the Albany Nanotech Complex. Nearly 50,000 square feet on the sixth floor were previously leased to CommerceHub,", "<b>IBM</b> has increased its dividend for the last 23 years. <b>IBM</b> has AI software and services with Watson and other initiatives. <b>IBM</b> has combined AI with its hybrid cloud services. <b>IBM</b>&#39;s AI services could boost its share price over the coming years. Read the full ...", "Stanbic Uganda selects IBM to help build banking-as-a-platform services to provide more secure integrated banking services for", "Regarding advanced delivery of information to customers, Kyndryl has redeployed more than 5,500 delivery professionals to serve new revenue streams and backfill attrition. This resulted in annualized savings of $275 million versus a $200 million target, Wyshner says.", "The PrestoDB community will come together this Wednesday for PrestoCon Day, the third annual virtual event showcasing the popular open source SQL engine.", "Kirland Ellis LLP can represent IBM Corp. in its software copyright lawsuit against a former business partner that has also repeatedly used the law firm, a New York federal court ruled.", "Along with hybrid cloud, IBM sees AI as a crucial, transformational technology. But AI needs to be tuned to specific business needs."], "datePublished": ["2023-06-12T08:56:00.0000000Z", "2023-06-12T17:58:00.0000000Z", "2023-06-12T19:21:00.0000000Z", "2023-06-08T20:58:00.0000000Z", "2023-06-11T06:46:00.0000000Z", "2023-06-12T15:59:00.0000000Z", "2023-06-06T11:38:14.0000000Z", "2023-06-05T19:31:00.0000000Z", "2023-06-09T20:13:00.0000000Z", "2023-06-02T16:10:00.0000000Z"], "url": ["https://news.yahoo.com/endicotts-history-stretches-e-j-085621450.html", "https://optics.org/news/14/6/16", "https://www.benzinga.com/pressreleases/23/06/ab32822730/revolutionizing-business-intelligence-for-the-ibm-i-introducing-lansa-bi", "https://www.bizjournals.com/albany/news/2023/06/08/ibm-zen-building-offices-albany.html", "https://www.msn.com/en-us/money/markets/ibm-buy-for-the-5percent-dividend-hold-for-the-ai-upside/ar-AA1clx0L", "https://www.itnewsafrica.com/2023/06/secure-and-integrated-banking-stanbic-uganda-partners-with-ibm/", "https://www.msn.com/en-us/money/companies/knydryls-cfo-on-the-strategy-that-propelled-the-ibm-spinoff-onto-the-fortune-500-boosted-revenue-and-saved-millions/ar-AA1ccb5m", "https://www.datanami.com/2023/06/05/ibm-to-showcase-open-analytics-push-at-prestocon-day/", "https://news.bloomberglaw.com/ip-law/ibm-can-use-kirkland-in-copyright-fight-with-other-firm-client", "https://www.rcrwireless.com/20230602/telecom-software/ibm-on-ai-enterprises-want-more-curated-solutions"], "texts": ["Well, it’s time for another stroll through history. On Saturday, June 3, I took a group of interested people through a two-hour walk along the historical and architectural landmarks of the village of Johnson City. A village built upon the strength of Endicott-Johnson and home to thousands of new arrivals – both immigrants and native-born citizens. It was a sunny day for a walk and the telling of stories of history. I am profusely thankful for the generous notes of village historian Janet Ottman. This Saturday, June 17, it’s time for another walk along the streets of our community. This", "Photonics World IBM to build its first European quantum data center 12 Jun 2023 Facility in Ehningen, Germany, set to open in 2024; to serve “expanding ecosystem”. On June 6, IBM announced plans to open its first Europe-based quantum data center to facilitate access to cutting-edge quantum computing for companies, research institutions and government agencies. The data center is expected to be operational in 2024, with multiple IBM quantum computing systems, each with “utility scale quantum processors”, meaning those of more than 100 qubits. The data center will be located at IBM’s facility in Ehningen, Germany, and will serve as", "LANSA, a leading provider of IBM i modernization solutions, has introduced LANSA BI, a developer toolkit for standalone or embedded business intelligence built on native DB2 integration. In collaboration with its sister brand, Yellowfin, LANSA BI simplifies the implementation of advanced business intelligence technologies for the IBM i user base. LANSA BI democratizes access to business intelligence for all stakeholders by equipping developers with pre-built analytics modules to create shareable dashboards that present reliable data in real-time. These visually striking and highly interactive dashboards come with sophisticated drill-down and drill-up capabilities, making it easier for end-users to uncover insights. In", " ", "You are using an older browser version. Please use a supported version for the best MSN experience.", "Stanbic Uganda collaborates with IBM to build cutting-edge banking-as-a-platform services, to ensure enhanced customer experiences and seamless integration in the digital era. In response to the pandemic, Uganda has placed significant emphasis on implementing intelligent policies to address societal challenges and stimulate economic growth, guided by the national development plan known as Uganda Vision 2040. According to the United Nations Development Programme (UNDP), Uganda has made remarkable strides in its digital transformation journey by bolstering its mobile network coverage to cater to the needs of its expanding digital-first population. As a result, it is projected that an estimated 4 million", "© Courtesy of Kyndryl Kyndryl CFO David Wyshner. Good morning. More from Fortune: 5 side hustles where you may earn over $20,000 per year—all while working from home Looking to make extra cash? This CD has a 5.15% APY right now Buying a house? Here's how much to save This is how much money you need to earn annually to comfortably buy a $600,000 home A year ago when I first spoke with David Wyshner, CFO of tech company Kyndryl, he was spending a great deal of his time working to attract new investors. Existing as a legacy spinoff from", "The PrestoDB community will come together this Wednesday for PrestoCon Day, the third annual virtual event showcasing the popular open source SQL engine. Representatives from Uber, Adobe, Alibaba, and TikTok will share stories about how they use PrestoDB and open analytics in general. One vendor looking to make a splash is IBM, which is the new owner of an enterprise PrestoDB offering and the latest adherent to open lakehouse architectures. Thanks to its consistently high performance on batch and interactive workloads, ability to scale linearly, and adherence to ANSI SQL standards, PrestoDB has become one of the most popular open", "Kirland Ellis LLP can represent IBM Corp. in its software copyright lawsuit against a former business partner that has also repeatedly used the law firm, a New York federal court ruled. British software company Micro Focus Inc. contractually allowed Kirkland to represent other parties in litigation on matters substantially unrelated to its work with Micro Focus, the US District Court for the Southern District of New York said. The court also denied Micro Focus’ bid to dismiss IBM’s copyright claim, but axed a breach of contract claim as preempted by federal copyright law. Thursday’s decision said none of Kirkland’s ...", "AI and hybrid cloud drive IBM Consulting’s growth platforms The types of generative AI solutions drawing investor and media hype at the moment—ChatGPT-4 and MidJourney, for instance—are huge models with broad capabilities. But for enterprises looking to add generative AI to their technology strategy in an effort to deliver a specific business outcome, IBM is “placing its emphasis” on smaller models that “are much more curated,” as IBM Consulting SVP John Granger explained at the recent JP Morgan Global Technology, Media and Communications Conference. He continued: “I think what’s critical here for businesses is confidence around the quality of the"]}