{"name": ["What Does Texas Instruments Incorporated&#39;s (NASDAQ:<b>TXN</b>) Share Price Indicate?", "$100 Invested In Texas Instruments 15 Years Ago Would Be Worth This Much Today", "Texas Instruments Incorporated (<b>TXN</b>) Analyst Updates Price Targets And Ratings", "Texas Instruments (<b>TXN</b>) Gains But Lags Market: What You Should Know"], "description": ["The share price seems sensible at the moment according to my price multiple model, where I compare the company&#39;s price-to-earnings ratio to the industry average. In this instance, I’ve used the price-to-earnings (PE) ratio given that there is not enough information to reliably forecast the stock’s cash flows.", "Texas Instruments (NASDAQ:TXN) has outperformed the market over the past 15 years by 4.45% on an annualized basis producing an average annual return of 12.47%. Currently, Texas Instruments has a market capitalization of $156.", "Texas Instruments Incorporated (NASDAQ:TXN) price on Friday, June 09, fall -0.95% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $170.59. A look at the stock’s price movement,", "Texas Instruments (TXN) closed at $170.36 in the latest trading session, marking a +0.06% move from the prior day."], "datePublished": ["2023-06-09T14:00:00.0000000Z", "2023-06-07T17:00:25.0000000Z", "2023-06-10T14:38:00.0000000Z", "2023-06-06T21:50:00.0000000Z"], "url": ["https://finance.yahoo.com/news/does-texas-instruments-incorporateds-nasdaq-140026541.html", "https://www.msn.com/en-us/money/savingandinvesting/100-invested-in-texas-instruments-15-years-ago-would-be-worth-this-much-today/ar-AA1cfZY6", "https://stocksregister.com/2023/06/10/texas-instruments-incorporated-txn-analyst-updates-price-targets-and-ratings/", "https://finance.yahoo.com/news/texas-instruments-txn-gains-lags-215009583.html"], "texts": ["Let's talk about the popular Texas Instruments Incorporated (NASDAQ:TXN). The company's shares saw significant share price movement during recent months on the NASDAQGS, rising to highs of US$186 and falling to the lows of US$161. Some share price movements can give investors a better opportunity to enter into the stock, and potentially buy at a lower price. A question to answer is whether Texas Instruments' current trading price of US$172 reflective of the actual value of the large-cap? Or is it currently undervalued, providing us with the opportunity to buy? Let’s take a look at Texas Instruments’s outlook and value", "Texas Instruments (NASDAQ:TXN) has outperformed the market over the past 15 years by 4.45% on an annualized basis producing an average annual return of 12.47%. Currently, Texas Instruments has a market capitalization of $156.33 billion. Buying $100 In TXN: If an investor had bought $100 of TXN stock 15 years ago, it would be worth $578.75 today based on a price of $172.24 for TXN at the time of writing. Texas Instruments's Performance Over Last 15 Years © Provided by Benzinga comp_fig Trending: Nancy Pelosi Unloads 2,900 Apple Shares Right Before WWDC — But There's A Catch - Apple (NASDAQ:AAPL)", "Texas Instruments Incorporated (NASDAQ:TXN) price on Friday, June 09, fall -0.95% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $170.59. A look at the stock’s price movement, the close in the last trading session was $172.23, moving within a range at $169.48 and $173.82. The PE ratio in trailing twelve months stood at 19.14. Turning to its 52-week performance, $186.30 and $144.46 were the 52-week high and 52-week low respectively. Overall, TXN moved 4.62% over the past month. 25-cent Stock Takes $11T Commodities Sector Digital One brilliantly-run technology firm has successfully partnered", "Texas Instruments (TXN) Gains But Lags Market: What You Should Know Texas Instruments (TXN) closed the most recent trading day at $170.36, moving +0.06% from the previous trading session. This change lagged the S&P 500's 0.24% gain on the day. At the same time, the Dow added 0.03%, and the tech-heavy Nasdaq gained 5.73%. Heading into today, shares of the chipmaker had gained 3.68% over the past month, lagging the Computer and Technology sector's gain of 10.73% and outpacing the S&P 500's gain of 3.56% in that time. Wall Street will be looking for positivity from Texas Instruments as it"]}