{"AAPL": {"name": ["<b>AAPL</b> Likely to Hold iPhone Shipments Steady", "Wells Fargo Maintains Apple (<b>AAPL</b>) Overweight Recommendation", "An In-Depth Look at Apple Inc.’s (<b>AAPL</b>) Stock Performance", "Here’s Why You Should Hold Apple (<b>AAPL</b>) for the Long-Term", "Thinking Of Buying Apple Inc. (NASDAQ: <b>AAPL</b>) Stock? Here’s What You Need To Know", "At US$193, Is It Time To Put Apple Inc. (NASDAQ:<b>AAPL</b>) On Your Watch List?", "Apple (<b>AAPL</b>) Stock Rises Briefly Following Rumors of Internal Generative AI Chatbot Rivalling ChatGPT", "New Buy Rating for Apple (<b>AAPL</b>), the Technology Giant"], "description": ["According to a Bloomberg report, tech giant Apple (NASDAQ: AAPL) intends to hold its iPhone shipments steady even as the smartphone market is", "Fintel reports that on July 24, 2023, Wells Fargo maintained coverage of Apple (NASDAQ:AAPL) with a Overweight recommendation. Analyst Price Forecast Suggests 0.16% Upside As of July 6, 2023, the average one-year price target for Apple is 192.", "The stock of Apple Inc. (AAPL) has seen a 0.66% increase in the past week, with a 4.34% gain in the past month, and a 15.18% flourish in the past quarter. The volatility ratio for the week is 1.84%, and the volatility levels for the past 30 days are at 1.", "Wedgewood Partners, an investment management company, released its “Wedgewood Partners Large Cap Focused Growth Fund” second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter,", "Apple Inc. (NASDAQ:AAPL) price on Friday, July 21, fall -0.62% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $191.94. A look at the stock’s price movement,", "Join A Paid User Research Session You’ll receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here", "Reportedly, select staff have access to the developing Apple AI chatbot the company plans will rival ChatGPT and Bard.", "Citi analyst Atif Malik maintained a Buy rating on Apple (AAPL – Research Report) today and set a price target of $240.00. The"], "datePublished": ["2023-07-24T13:44:47.0000000Z", "2023-07-24T18:11:31.0000000Z", "2023-07-24T04:08:00.0000000Z", "2023-07-20T10:34:00.0000000Z", "2023-07-22T14:03:00.0000000Z", "2023-07-21T14:00:00.0000000Z", "2023-07-20T08:16:00.0000000Z", "2023-07-20T09:55:00.0000000Z"], "url": ["https://www.msn.com/en-us/money/companies/aapl-likely-to-hold-iphone-shipments-steady/ar-AA1ehbxJ", "https://www.msn.com/en-us/money/savingandinvesting/wells-fargo-maintains-apple-aapl-overweight-recommendation/ar-AA1eiAjD", "https://newsheater.com/2023/07/24/an-in-depth-look-at-apple-inc-s-aapl-stock-performance-2/", "https://news.yahoo.com/why-hold-apple-aapl-long-103432783.html", "https://stocksregister.com/2023/07/22/thinking-of-buying-apple-inc-nasdaq-aapl-stock-heres-what-you-need-to-know/", "https://finance.yahoo.com/news/us-193-time-put-apple-140024913.html", "https://www.coinspeaker.com/apple-stock-generative-ai-chatbot/", "https://markets.businessinsider.com/news/stocks/new-buy-rating-for-apple-aapl-the-technology-giant-1032461851"], "texts": ["", "", "The stock of Apple Inc. (AAPL) has seen a 0.66% increase in the past week, with a 4.34% gain in the past month, and a 15.18% flourish in the past quarter. The volatility ratio for the week is 1.84%, and the volatility levels for the past 30 days are at 1.44% for AAPL. The simple moving average for the past 20 days is 0.76% for AAPL’s stock, with a 22.08% simple moving average for the past 200 days. Is It Worth Investing in Apple Inc. (NASDAQ: AAPL) Right Now? The price-to-earnings ratio for Apple Inc. (NASDAQ: AAPL) is 32.61x, which", "Wedgewood Partners, an investment management company, released its \"Wedgewood Partners Large Cap Focused Growth Fund\" second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter, Wedgewood Composite’s net return was 8.1% compared to the Standard & Poor’s 8.7%, Russell 1000 Growth Index’s 12.8%, and Russell 1000 Value Index’s 4.1% return for the same period. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Wedgewood Partners Large Cap Focused Growth Fund highlighted stocks like Apple Inc. (NASDAQ:AAPL) in the second quarter 2023 investor", "Apple Inc. (NASDAQ:AAPL) price on Friday, July 21, fall -0.62% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $191.94. A look at the stock’s price movement, the close in the last trading session was $193.13, moving within a range at $191.23 and $194.97. The beta value (5-Year monthly) was 1.29 while the PE ratio in trailing twelve months stood at 32.61. Turning to its 52-week performance, $198.23 and $124.17 were the 52-week high and 52-week low respectively. Overall, AAPL moved 4.34% over the past month. Top 5 AI Stocks to Buy for", "Let's talk about the popular Apple Inc. (NASDAQ:AAPL). The company's shares saw a significant share price rise of over 20% in the past couple of months on the NASDAQGS. With many analysts covering the large-cap stock, we may expect any price-sensitive announcements have already been factored into the stock’s share price. But what if there is still an opportunity to buy? Let’s examine Apple’s valuation and outlook in more detail to determine if there’s still a bargain opportunity. See our latest analysis for Apple What's The Opportunity In Apple? The share price seems sensible at the moment according to my", "Reportedly, select staff have access to the developing Apple AI chatbot the company plans will rival ChatGPT and Bard. Tech giant Apple Inc (NASDAQ: AAPL) is reportedly developing an artificial intelligence (AI) generative pre-trained transformer (GPT) model to rival OpenAI’s ChatGPT. Following a news report initially published by Bloomberg, Apple stock briefly rose but ended the day up by 0.71%, at $195.1. As of press time, AAPL has fallen a further 0.64% from its close and is at $193.75 in after-hours trading. In the last year, AAPL has seen a 27.48% rise and more than 50% since January. Unofficially called", "Citi analyst Atif Malik maintained a Buy rating on Apple (AAPL – Research Report) today and set a price target of $240.00. The company’s shares closed yesterday at $195.10. According to TipRanks, Malik is a top 100 analyst with an average return of 30.7% and a 71.70% success rate. Malik covers the Technology sector, focusing on stocks such as Nvidia, Apple, and Wolfspeed. The word on The Street in general, suggests a Strong Buy analyst consensus rating for Apple with a $195.67 average price target, a 0.29% upside from current levels. In a report released on July 18, Jefferies also"], "sentiments": ["positive", "positive", "positive", "neutral", "negative", "positive", "positive", "positive"], "summaries": ["All photographs subject to copyright.", "All photographs subject to copyright.", "Apple has seen a 0.66% increase in the past week, with a 4.34% gain in the past month, and a 15.18% flourish in the past", "In the second quarter, the fund returned 8.1% compared to S&P, Russell 1000 Growth Index, and Russell 1000 Value Index.", "Shares of Apple closed at $191.94 down -0.62% in last trading session.", "Is the share price ‘sensible’ at the moment?", "Tech giant is developing an artificial intelligence model to rival OpenAI’s ChatGPT. Report says select staff have access to the technology", "Atif Malik has a new Buy rating on Apple with a price target of $240."]}, "AVGO": {"name": ["Investors in Broadcom (NASDAQ:<b>AVGO</b>) have seen incredible returns of 374% over the past five years", "Broadcom Inc. (<b>AVGO</b>) Shares Soar Above 1-Year High", "Looking At Broadcom&#39;s Recent Unusual Options Activity", "How AI Chip Growth Is Pushing Broadcom, Stock Of The Day, Toward A Buy Point", "Broadcom Inc. (<b>AVGO</b>) Sitting On The Launch Pad, Waiting For Long Term Investors", "Steven Romick Cuts Back Alphabet Stakes, Adds To Heineken And Douglas Emmett", "Broadcom Inc. (<b>AVGO</b>) Dips More Than Broader Markets: What You Should Know", "Avago Technologies (<b>AVGO</b>) Is Water-Logged And Getting Wetter Today", "Guru Fundamental Report for <b>AVGO</b>"], "description": ["When you buy shares in a company, it&#39;s worth keeping in mind the possibility that it could fail, and you could", "Broadcom Inc. (NASDAQ: AVGO) has seen a rise in its stock price by 0.95 in relation to its previous close of 888.34. However, the company has experienced a 0.92% gain in its stock price over the last five trading sessions.", "Taking into account the Volume and Open Interest on these contracts, it appears that whales have been targeting a price range from $720.0 to $1070.0 for Broadcom over the last 3 months. In terms of liquidity and interest, the mean open interest for Broadcom options trades today is 397.1 with a total volume of 820.00.", "Broadcom is the IBD Stock Of The Day as the chipmaker and infrastructure software provider moves closer to completing its acquisition of VMware.", "Broadcom Inc. (NASDAQ:AVGO) price on Thursday, July 20, fall -1.45% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $888.34. A look at the stock’s price movement,", "During the quarter, Romick also sold out of several stocks, including Churchill Capital Corp VII ( CVII.U, Financial) and Metals Acquisition Ltd. ( MTAL, Financial ), and cut back his investments in Heidelberg Materials AG ( XTER:HEI, Financial ), Netflix NFLX -2.3% Inc. ( NFLX, Financial) and Holcim Ltd. ( XSWX:HOLN, Financial ).", "Broadcom Inc. (<b>AVGO</b>) closed at $888.34 in the latest trading session, marking a -1.45% move from the prior day. This change lagged the S&amp;P 500&#39;s daily loss of 0.68%. At the same time, the Dow added 0.47%, and the tech-heavy Nasdaq lost 3.19%. Heading into ...", "Trade-Ideas LLC identified Avago Technologies (<b>AVGO</b>) as a &quot;water-logged and getting wetter&quot; (weak stocks crossing below support with today&#39;s range greater than 200%) candidate ) as a &quot;water-logged ...", "Below is Validea&#39;s guru fundamental report for BROADCOM INC (<b>AVGO</b>). Of the 22 guru strategies we follow, <b>AVGO</b> rates highest using our Twin Momentum Investor model based on the published strategy ..."], "datePublished": ["2023-07-24T11:01:00.0000000Z", "2023-07-24T04:03:00.0000000Z", "2023-07-24T13:47:00.0000000Z", "2023-07-21T18:39:00.0000000Z", "2023-07-21T11:41:00.0000000Z", "2023-07-20T22:00:00.0000000Z", "2023-07-20T21:45:00.0000000Z", "2023-07-20T00:00:00.0000000Z", "2023-07-16T13:37:00.0000000Z"], "url": ["https://finance.yahoo.com/news/investors-broadcom-nasdaq-avgo-seen-110054321.html", "https://newsheater.com/2023/07/24/broadcom-inc-avgo-shares-soar-above-1-year-high/", "https://www.benzinga.com/markets/options/23/07/33346500/looking-at-broadcoms-recent-unusual-options-activity", "https://www.msn.com/en-us/money/topstocks/how-ai-chip-growth-is-pushing-broadcom-stock-of-the-day-toward-a-buy-point/ar-AA1ebldd", "https://stocksregister.com/2023/07/21/broadcom-inc-avgo-sitting-on-the-launch-pad-waiting-for-long-term-investors/", "https://www.forbes.com/sites/gurufocus/2023/07/20/steven-romick-cuts-back-alphabet-stakes-adds-to-heineken-and-douglas-emmett/", "https://www.msn.com/en-us/money/topstocks/broadcom-inc-avgo-dips-more-than-broader-markets-what-you-should-know/ar-AA1e8KhZ", "https://www.thestreet.com/markets/avago-technologies-avgo-is-water-logged-and-getting-wetter-today-12909747", "https://www.nasdaq.com/articles/guru-fundamental-report-for-avgo-45"], "texts": ["When you buy shares in a company, it's worth keeping in mind the possibility that it could fail, and you could lose your money. But when you pick a company that is really flourishing, you can make more than 100%. Long term Broadcom Inc. (NASDAQ:AVGO) shareholders would be well aware of this, since the stock is up 298% in five years. It's also good to see the share price up 44% over the last quarter. Let's take a look at the underlying fundamentals over the longer term, and see if they've been consistent with shareholders returns. Check out our latest", "Broadcom Inc. (NASDAQ: AVGO) has seen a rise in its stock price by 0.95 in relation to its previous close of 888.34. However, the company has experienced a 0.92% gain in its stock price over the last five trading sessions. Is It Worth Investing in Broadcom Inc. (NASDAQ: AVGO) Right Now? Broadcom Inc. (NASDAQ: AVGO) has a price-to-earnings ratio of 28.06x that is above its average ratio. Additionally, the 36-month beta value for AVGO is 1.12. There are mixed opinions on the stock, with 17 analysts rating it as a “buy,” 4 rating it as “overweight,” 6 rating it as", "A whale with a lot of money to spend has taken a noticeably bearish stance on Broadcom. Looking at options history for Broadcom AVGO we detected 13 strange trades. If we consider the specifics of each trade, it is accurate to state that 38% of the investors opened trades with bullish expectations and 61% with bearish. From the overall spotted trades, 3 are puts, for a total amount of $148,010 and 10, calls, for a total amount of $638,798. What's The Price Target? Taking into account the Volume and Open Interest on these contracts, it appears that whales have been", "", "Broadcom Inc. (NASDAQ:AVGO) price on Thursday, July 20, fall -1.45% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $888.34. A look at the stock’s price movement, the close in the last trading session was $901.37, moving within a range at $886.00 and $906.9999. The beta value (5-Year monthly) was 1.12 while the PE ratio in trailing twelve months stood at 27.80. Turning to its 52-week performance, $921.78 and $415.07 were the 52-week high and 52-week low respectively. Overall, AVGO moved 2.34% over the past month. Top 5 AI Stocks to Buy for", " ", "", " ", "Below is Validea's guru fundamental report for BROADCOM INC (AVGO). Of the 22 guru strategies we follow, AVGO rates highest using our Twin Momentum Investor model based on the published strategy of Dashan Huang. This momentum model looks for a combination of fundamental momentum and price momentum. BROADCOM INC (AVGO) is a large-cap growth stock in the Semiconductors industry. The rating using this strategy is 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates"], "sentiments": ["positive", "positive", "positive", "positive", "negative", "positive", "positive", "positive", "neutral"], "summaries": ["Broadcom has grown its earnings per share by 298% over five years.", "The company has seen a rise in its stock price in relation to its previous close of 888.34.", "Whales have taken a bearish stance on the stock.", "All photographs subject to copyright.", "Shares of the firm fell -1.45% to close at $888.34.", "All photographs subject to copyright.", "All photographs subject to copyright.", "All photographs subject to copyright.", "AVGO is a large-cap growth stock in Semiconductors industry."]}, "DOCN": {"name": ["DigitalOcean Holdings, Inc. (<b>DOCN</b>) Outpaces Stock Market Gains: What You Should Know", "DigitalOcean Holdings, Inc. (NYSE:<b>DOCN</b>) Is About To Turn The Corner", "Longtime tech entrepreneur Anshu Agarwal joins venture firm to ‘let founders do their magic’", "Barclays Maintains DigitalOcean Holdings (<b>DOCN</b>) Overweight Recommendation", "DigitalOcean Holdings Inc. [<b>DOCN</b>] short interest falls, dropping by 13.04 million million shares", "The DigitalOcean Holdings Inc. (NYSE: <b>DOCN</b>) Metrics You Need To Know Right Now", "Expert Ratings for DigitalOcean Holdings", "Morgan Stanley Reiterates DigitalOcean Holdings (<b>DOCN</b>) Underweight Recommendation", "DigitalOcean (<b>DOCN</b>) Expands AI Footprint With Paperspace Buyout"], "description": ["DigitalOcean Holdings, Inc. (<b>DOCN</b>) closed the most recent trading day at $48.76, moving +0.45% from the previous trading session. This change outpaced the S&amp;P 500&#39;s 0.03% gain on the day. Elsewhere, the Dow gained 0.01%, while the tech-heavy Nasdaq lost 1.37%. Heading into today, shares of the company had gained 24.33% over the past month, outpacing the Computer and Technology sector&#39;s gain of ...", "According to the 13 industry analysts covering DigitalOcean Holdings, the consensus is that breakeven is near. They anticipate the company to incur a final loss in 2022, before generating positive profits of US$7.", "East Coast-based venture-capital firm Converge named Anshu Agarwal as a general partner, thereby establishing a base camp in Silicon Valley.", "Fintel reports that on July 19, 2023, Barclays maintained coverage of DigitalOcean Holdings (NYSE:DOCN) with a Overweight recommendation. Analyst Price Forecast Suggests 17.94% Downside As of July 6,", "As published in a research note from Piper Sandler on June 22, 2023, DigitalOcean Holdings Inc. [DOCN] has been rated down from a Neutral to an Underweight and the price target has been revised to $35. This represents a -38.69% premium over Thursday’s closing price.", "DigitalOcean Holdings Inc. (NYSE:DOCN) shares, rose in value on Friday, July 07, with the stock price up by 3.46% to the previous day’s close as strong demand from buyers drove the stock to $46.65. Actively observing the price movement in the recent trading,", "Below is a summary of how these 4 analysts rated DigitalOcean Holdings over the past 3 months. The greater the number of bullish ratings, the more positive analysts are on the stock and the greater the number of bearish ratings, the more negative analysts are on the stock", "Fintel reports that on July 14, 2023, Morgan Stanley reiterated coverage of DigitalOcean Holdings ( NYSE:DOCN) with a Underweight recommendation.", "DigitalOcean <b>DOCN</b> has made a significant move to expand its artificial intelligence (AI) offerings by acquiring Paperspace, a leading provider of cloud infrastructure as a service, for $111 ..."], "datePublished": ["2023-07-21T22:00:00.0000000Z", "2023-07-13T16:56:00.0000000Z", "2023-07-21T12:30:00.0000000Z", "2023-07-19T19:36:20.0000000Z", "2023-07-21T21:47:00.0000000Z", "2023-07-07T17:09:00.0000000Z", "2023-07-12T21:59:00.0000000Z", "2023-07-15T16:03:00.0000000Z", "2023-07-07T16:34:00.0000000Z"], "url": ["https://www.msn.com/en-us/money/markets/digitalocean-holdings-inc-docn-outpaces-stock-market-gains-what-you-should-know/ar-AA1ebLGk", "https://finance.yahoo.com/news/digitalocean-holdings-inc-nyse-docn-165628417.html", "https://www.marketwatch.com/story/longtime-tech-entrepreneur-anshu-agarwal-joins-venture-firm-to-let-founders-do-their-magic-bdd5e686", "https://www.msn.com/en-us/money/smallbusiness/barclays-maintains-digitalocean-holdings-docn-overweight-recommendation/ar-AA1e5pyT", "https://knoxdaily.com/2023/07/21/digitalocean-holdings-inc-docn-short-interest-falls-dropping-by-13-04-million-million-shares/", "https://stocksregister.com/2023/07/07/the-digitalocean-holdings-inc-nyse-docn-metrics-you-need-to-know-right-now/", "https://markets.businessinsider.com/news/stocks/expert-ratings-for-digitalocean-holdings-1032442374", "https://www.nasdaq.com/articles/morgan-stanley-reiterates-digitalocean-holdings-docn-underweight-recommendation", "https://finance.yahoo.com/news/digitalocean-docn-expands-ai-footprint-143500556.html"], "texts": ["", "With the business potentially at an important milestone, we thought we'd take a closer look at DigitalOcean Holdings, Inc.'s (NYSE:DOCN) future prospects. DigitalOcean Holdings, Inc., through its subsidiaries, operates a cloud computing platform in North America, Europe, Asia, and internationally. The US$4.3b market-cap company posted a loss in its most recent financial year of US$24m and a latest trailing-twelve-month loss of US$41m leading to an even wider gap between loss and breakeven. The most pressing concern for investors is DigitalOcean Holdings' path to profitability – when will it breakeven? In this article, we will touch on the expectations for the", "Longtime Silicon Valley entrepreneur Anshu Agarwal has decided it’s time to be a mentor rather than an operator. In 2021, DigitalOcean Holdings Inc. DOCN, -3.88% acquired Agarwal’s cloud company, Nimbella, the fifth startup in her portfolio of nearly two decades. After serving as vice president and general manager of DigitalOcean’s Serverless & Kubernetes business unit, elevating DigitalOcean to more than 600,000 customers, she was ready for a change. “When I left DigitalOcean, I could have started another company or joined an established one,” Agarwal said in an interview. “I know what founders want after years as an operator.” On Thursday,", "", "Investors can expect a company’s stock to rise or fall based on the buying and selling of stock by its insiders. DigitalOcean Holdings Inc. shares valued at $276,540 were sold by Guy Jeffrey Scott on Jul 10. At $46.09 per share, Guy Jeffrey Scott sold 6,000 shares. The insider’s holdings dropped to 144,262 shares worth approximately $7.0 million following the completion of this transaction. Top 5 AI Stocks to Buy for 2023 The artificial intelligence (AI) revolution is already here. And it's about to change everything we know about everything. According to Grand View Research, the global AI boom could", "DigitalOcean Holdings Inc. (NYSE:DOCN) shares, rose in value on Friday, July 07, with the stock price up by 3.46% to the previous day’s close as strong demand from buyers drove the stock to $46.65. Actively observing the price movement in the recent trading, the stock is buoying the session at $45.09, falling within a range of $39.17 and $45.4039. The value of beta (5-year monthly) is 1.15. Referring to stock’s 52-week performance, its high was $53.88, and the low was $23.38. On the whole, DOCN has fluctuated by 4.41% over the past month. Top 5 AI Stocks to Buy for", "Within the last quarter, DigitalOcean Holdings (NYSE:DOCN) has observed the following analyst ratings: Bullish Somewhat Bullish Indifferent Somewhat Bearish Bearish Total Ratings 1 1 1 1 0 Last 30D 1 0 0 0 0 1M Ago 0 0 0 1 0 2M Ago 0 0 0 0 0 3M Ago 0 1 1 0 0 According to 4 analyst offering 12-month price targets in the last 3 months, DigitalOcean Holdings has an average price target of $46.5 with a high of $63.00 and a low of $35.00. Below is a summary of how these 4 analysts rated DigitalOcean Holdings over", "Fintel reports that on July 14, 2023, Morgan Stanley reiterated coverage of DigitalOcean Holdings (NYSE:DOCN) with a Underweight recommendation. Analyst Price Forecast Suggests 12.50% Downside As of July 6, 2023, the average one-year price target for DigitalOcean Holdings is 40.80. The forecasts range from a low of 30.30 to a high of $66.15. The average price target represents a decrease of 12.50% from its latest reported closing price of 46.63. See our leaderboard of companies with the largest price target upside. The projected annual revenue for DigitalOcean Holdings is 756MM, an increase of 23.13%. The projected annual non-GAAP EPS is", "DigitalOcean DOCN has made a significant move to expand its artificial intelligence (AI) offerings by acquiring Paperspace, a leading provider of cloud infrastructure as a service, for $111 million in cash. The acquisition allows DigitalOcean to integrate Paperspace's advanced technology into its platform, providing customers with enhanced capabilities for testing, developing, and deploying AI and machine learning (ML) applications. Paperspace brings valuable GPU-powered infrastructure and an AI/ML-focused software stack to DigitalOcean's portfolio, catering to the increasing demand for AI/ML cloud solutions. This acquisition aligns with DigitalOcean's mission to simplify cloud experiences for small and medium-sized businesses (SMBs) and startups. Both"], "sentiments": ["positive", "positive", "positive", "positive", "positive", "positive", "neutral", "neutral", "positive"], "summaries": ["All photographs subject to copyright.", "Check out our latest analysis for DigitalOcean Holdings", "DigitalOcean acquired Agarwal’s Nimbella in 2021", "All photographs subject to copyright.", "Guy Jeffrey Scott sold 6,000 shares at $46.09 per share.", "DigitalOcean Holdings Inc. (NYSE:DOCN) shares, rose in value on Friday, July 07.", "Wall Street analysts have a Bullish view on the stock, with a consensus target price of $46.5.", "DigitalOcean Holdings has been given a Underweight rating by Morgan Stanley.", "Acquires Paperspace, a leading provider of cloud infrastructure as a service."]}, "IBM": {"name": ["<b>IBM</b> Report: Average Cost of a Data Breach Rises to $4.45 Million", "The <b>IBM</b> mainframe: How it runs and why it survives", "Is <b>IBM</b> an Excellent Dividend Stock to Buy?", "<b>IBM</b> Report: Half of Breached Organizations Unwilling to Increase Security Spend Despite Soaring Breach Costs", "<b>IBM</b> to reimburse employees for work-from-home expenses amid COVID-19", "UK awards $84.4M biometric platform tender to <b>IBM</b>", "Red Hat saved <b>IBM</b>’s bacon this quarter", "Why <b>IBM</b> Stock Popped After Earnings", "<b>IBM</b> reports earnings beat, but misses on revenue", "<b>IBM</b> Security report finds data breach costs have hit new highs in 2023"], "description": ["IBM provides insight on the rise in the average cost of data breaches as well as some tips for how to prevent and mitigate them.", "Mainframes descended directly from the technology of the first computers in the 1950s. Instead of being streamlined into low-cost desktop or server use, though, they evolved to handle massive data workloads, like bulk data processing and high-volume financial transactions.", "You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more ...", "IBM Security today released its annual Cost of a Data Breach Report, showing the global average cost of a data breach", "The employees asked for penalties for IBM’s alleged failure to reimburse employees for work-from-home expenses necessarily incurred following the stay-at-home order. In response, IBM filed demurrers. The trial court granted the demurrers and ruled in IBM’s favor.", "The United States company will be tasked with building a so-called biometric matcher service platform for the UK&#39;s Home Office.", "IBM reported earnings this week, which weren&#39;t exactly stellar, but without Red Hat&#39;s revenue, it could have been far worse.", "Analysts had forecast IBM would earn only $2.01 per share in &quot;adjusted&quot; profits for the quarter, and IBM beat that guess with a stick, earning $2.18 per share. Sales that were supposed to approach $15.6 billion, however, fell just short of that mark, coming in at $15.5 billion instead.", "IBM&#39;s data and artificial intelligence products showed the fastest expansion, growing 10% from a year earlier, the company said.", "A new report from IBM Security today finds that the relentless rise in data breach costs continues unabated in 2023, with the global average data breach cost increasing to $4.45 million, up 15% over the last three years."], "datePublished": ["2023-07-24T13:36:00.0000000Z", "2023-07-24T11:01:00.0000000Z", "2023-07-24T14:24:00.0000000Z", "2023-07-24T15:08:00.0000000Z", "2023-07-24T16:07:00.0000000Z", "2023-07-24T19:26:00.0000000Z", "2023-07-21T18:25:00.0000000Z", "2023-07-20T17:47:07.0000000Z", "2023-07-19T20:57:00.0000000Z", "2023-07-24T04:01:00.0000000Z"], "url": ["https://www.techrepublic.com/article/ibm-data-breach-cost/", "https://arstechnica.com/information-technology/2023/07/the-ibm-mainframe-how-it-runs-and-why-it-survives/", "https://www.fool.com/investing/2023/07/24/is-ibm-an-excellent-dividend-stock-to-buy/", "https://www.datanami.com/this-just-in/ibm-report-half-of-breached-organizations-unwilling-to-increase-security-spend-despite-soaring-breach-costs/", "https://www.hcamag.com/us/news/general/ibm-to-reimburse-employees-for-work-from-home-expenses-amid-covid-19/453728", "https://www.biometricupdate.com/202307/uk-awards-84-4m-biometric-platform-tender-to-ibm", "https://techcrunch.com/2023/07/21/red-hat-ibm-earnings/", "https://www.msn.com/en-us/money/topstocks/why-ibm-stock-popped-after-earnings/ar-AA1e8myM", "https://www.cnbc.com/2023/07/19/ibm-q2-earnings-report-2023.html", "https://siliconangle.com/2023/07/24/ibm-security-report-finds-data-breach-costs-hit-new-highs-2023/"], "texts": ["IBM Security also provided tips for how to prevent and mitigate data breaches. Data breach costs rose to $4.45 million per incident in 2023, IBM found in its annual Cost of a Data Breach report. Customer and employee personal identifiable information was the most commonly breached type of data in 2023 and was involved in 52% of all breaches reported. Jump to: Average data breach cost rose to $4.45 million per incident Data breach costs rose to $4.45 million per incident in 2023, up 2.3% from $4.35 million in 2022. Overall, the average cost has increased 15.3% from the $3.86", "Mainframe computers are often seen as ancient machines—practically dinosaurs. But mainframes, which are purpose-built to process enormous amounts of data, are still extremely relevant today. If they’re dinosaurs, they’re T-Rexes, and desktops and server computers are puny mammals to be trodden underfoot. It’s estimated that there are 10,000 mainframes in use today. They’re used almost exclusively by the largest companies in the world, including two-thirds of Fortune 500 companies, 45 of the world’s top 50 banks, eight of the top 10 insurers, seven of the top 10 global retailers, and eight of the top 10 telecommunications companies. And most of", "Market-beating stocks from our award-winning analyst team. Calculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 07/24/2023. Discounted offers are only available to new members. Stock Advisor list price is $199 per year.", "IBM Report: Half of Breached Organizations Unwilling to Increase Security Spend Despite Soaring Breach Costs CAMBRIDGE, Mass., July 24, 2023 — IBM Security today released its annual Cost of a Data Breach Report, showing the global average cost of a data breach reached $4.45 million in 2023 – an all-time high for the report and a 15% increase over the last 3 years. Detection and escalation costs jumped 42% over this same time frame, representing the highest portion of breach costs, and indicating a shift towards more complex breach investigations. According to the 2023 IBM report, businesses are divided in", "On Mar. 19, 2020, California’s governor issued an executive order requiring residents to stay at home amid the COVID-19 pandemic, subject to some exceptions. In line with this issuance, IBM directed its employees to work at home. In December 2020, an Experis employee sued his employer under California’s Private Attorneys General Act (PAGA) on behalf of the state’s Labor and Workforce Development Agency and other aggrieved employees. Later, he added IBM as a defendant because it and Experis were allegedly joint employers. The plaintiff joined the case as an additional PAGA representative. The employees alleged violations of section 2802(a) of", "IBM has won a £65.6 million (US$84.4 million) tender for a biometric matching platform that will bring together biometric databases used by British immigration and law enforcement authorities under one roof. The United States company will be tasked with building a so-called matcher service platform for the UK’s Home Office, the ministry charged with border control and law and order. The department has been on a mission to create a “core platform for biometric matching and identification services,” which includes joining separate systems for matching fingerprints and faces. The overall cost of the program is estimated to exceed £1.3 billion", "IBM reported earnings this week, and if we’re being honest, the results were rather uninspiring. The company generated revenue of around $15.5 billion, down a disappointing 0.4% from its year-ago result. However, even inside its less-than-stellar report, there were some favorable tidbits for the well-known tech giant. On the negative side, IBM’s infrastructure business is deep in the doldrums with revenue down 14.6% to $3.6 billion, compared to year-ago metrics. That overall loss includes IBM Z Systems, the company’s mainframe business, falling 30% on its own. Z Systems has been pretty solid for the company in the past, so it’s", "", "IBM Chairman and CEO Arvind Krishna appears on a panel session at the World Economic Forum in Davos, Switzerland, Jan. 17, 2023. IBM reported second-quarter earnings Wednesday that topped analysts' estimates as the company expanded its gross margin. Revenue missed consensus estimates. Shares of IBM were little changed in extended trading after the report. Here's how the company did: Earnings: $2.18, adjusted, versus $2.01 per share expected, according to Refinitiv. $2.18, adjusted, versus $2.01 per share expected, according to Refinitiv. Revenue: $15.48 billion, versus $15.58 billion expected, according to Refinitiv. Net income for the quarter rose 13% to $1.6 billion", " "], "sentiments": ["neutral", "neutral", "positive", "negative", "negative", "positive", "negative", "positive", "positive", "positive"], "summaries": ["Customer and employee personal identifiable information was the most commonly breached type of data.", "It’s estimated that there are 10,000 mainframes in use today. They’re used almost exclusively by the largest companies in the world", "Top stock picks from our Stock Advisor service.", "Global average cost of a data breach reached $4.45 million in 2023. Half of organizations are unwilling to increase security spend despite breach costs", "Experis employee sues IBM on behalf of state’s Labor and Workforce Development Agency. California’s governor issued an executive order requiring residents to", "The overall cost of the program is estimated to be more than £1.3 billion.", "Technology giant’s infrastructure business is in decline. Z Systems has been pretty solid in the past.", "All photographs subject to copyright.", "Second-quarter earnings topped analysts' estimates as company expanded gross margin. Revenue missed estimates as the company expanded its gross margin", "All photographs subject to copyright."]}, "MSFT": {"name": ["<b>MSFT</b> Earnings Preview: Here’s What to Expect from Fiscal Q4", "Excitement Over Generative AI Pushed Microsoft Corporation (<b>MSFT</b>) in Q2", "Microsoft Corporation (<b>MSFT</b>) Stock: Analyzing the Quarterly Movement", "<b>MSFT</b> Q423", "Microsoft (<b>MSFT</b>) to Report Q4 Earnings: What&#39;s in the Cards?", "Unusual Call Option Trade in Microsoft (<b>MSFT</b>) Worth $9,084.76K", "Slow Growth in Azure to Impact Microsoft&#39;s (<b>MSFT</b>) Q4 Earnings", "<b>MSFT</b> Earnings Preview: Here’s What to Expect in Fiscal Q4"], "description": ["Tech giant Microsoft (NASDAQ:MSFT) is scheduled to announce its fiscal fourth-quarter results on Tuesday, July 25. Investors and analysts will", "The Ithaka Group, an investment advisory firm, released “Ithaka US Growth Strategy” second-quarter 2023 investor letter. A copy of the same can be downloaded here. In the quarter, the strategy outperformed in a strong market,", "MSFT stock has gone down by -0.43%, with a monthly gain of 3.06% and a quarterly surge of 20.15%. The volatility ratio for the week is 3.63%, and the volatility levels for the last 30 days are 2.20% for Microsoft Corporation The simple moving average for the last 20 days is 1.", "Investors will be looking for early signs of traction from Microsoft’s artificial intelligence investments Tuesday afternoon when the company reports results for its fiscal fourth quarter. They’ll likely need to… Read More", "Microsoft MSFT is set to report fourth-quarter fiscal 2023 results on Jul 25. The Zacks Consensus Estimate for revenues is pegged at $55.36 billion, indicating growth of 6.74% from the figure reported in the year-ago quarter.", "ET an unusually large $9,084.76K block of Call contracts in Microsoft (MSFT) was sold, with a strike price of $250.00 / share, expiring in 427 day(s) (on September 20, 2024). Fintel tracks all large options trades,", "Microsoft&#39;s (MSFT) fourth-quarter fiscal 2023 performance is likely to have been aided by sluggish yet continued momentum in Azure cloud platform and advancements in generative AI to sustain growth.", "Tech giant Microsoft (NASDAQ:MSFT) is scheduled to announce its fiscal fourth-quarter results on Tuesday, July 25. Investors and analysts will"], "datePublished": ["2023-07-24T06:27:00.0000000Z", "2023-07-24T07:16:00.0000000Z", "2023-07-24T04:26:00.0000000Z", "2023-07-24T10:28:00.0000000Z", "2023-07-19T15:02:00.0000000Z", "2023-07-22T15:37:48.0000000Z", "2023-07-20T16:17:00.0000000Z", "2023-07-24T06:27:00.0000000Z"], "url": ["https://markets.businessinsider.com/news/stocks/msft-earnings-preview-here-s-what-to-expect-from-fiscal-q4-1032468886", "https://finance.yahoo.com/news/excitement-over-generative-ai-pushed-071658761.html", "https://newsheater.com/2023/07/24/microsoft-corporation-msft-stock-analyzing-the-quarterly-movement/", "https://www.geekwire.com/tag/msft-q423/", "https://www.msn.com/en-us/money/markets/microsoft-msft-to-report-q4-earnings-whats-in-the-cards/ar-AA1e4NET", "https://www.msn.com/en-us/money/companies/unusual-call-option-trade-in-microsoft-msft-worth-908476k/ar-AA1ecZAL", "https://finance.yahoo.com/news/slow-growth-azure-impact-microsofts-161700253.html", "https://markets.businessinsider.com/news/stocks/msft-earnings-preview-here-s-what-to-expect-in-fiscal-q4-1032468886"], "texts": ["Tech giant Microsoft (NASDAQ:MSFT) is scheduled to announce its fiscal fourth-quarter results on Tuesday, July 25. Investors and analysts will be keen to know the extent to which the company is benefiting from the AI-related boom and the trend in Azure’s growth rate, which has been decelerating in recent quarters due to macro pressures. Investors will also look forward to management’s commentary on the Activision deal. Wall Street seems bullish ahead of the upcoming results. Expectations from MSFT’s Fiscal Q4 Results Microsoft surpassed analysts’ earnings expectations in the first three quarters of Fiscal 2023. In Q3 FY23 (ended March 31,", "The Ithaka Group, an investment advisory firm, released “Ithaka US Growth Strategy” second-quarter 2023 investor letter. A copy of the same can be downloaded here. In the quarter, the strategy outperformed in a strong market, returning 16.1% (gross) compared to its benchmark the Russell 1000 Growth Index’s 12.8% gain. The outperformance of the fund was entirely contributed by stock selection, with a slight benefit from sector allocation. In addition, please check the fund’s top five holdings to know its best picks in 2023. The Ithaka Group highlighted stocks like Microsoft Corporation (NASDAQ:MSFT) in the second quarter 2023 investor letter. Headquartered", "In the past week, MSFT stock has gone down by -0.43%, with a monthly gain of 3.06% and a quarterly surge of 20.15%. The volatility ratio for the week is 3.63%, and the volatility levels for the last 30 days are 2.20% for Microsoft Corporation The simple moving average for the last 20 days is 1.10% for MSFT stock, with a simple moving average of 25.43% for the last 200 days. Is It Worth Investing in Microsoft Corporation (NASDAQ: MSFT) Right Now? Microsoft Corporation (NASDAQ: MSFT) has a price-to-earnings ratio of 37.26x that is above its average ratio. Additionally, the", "Investors will be looking for early signs of traction from Microsoft’s artificial intelligence investments Tuesday afternoon when the company reports results for its fiscal fourth quarter. They’ll likely need to… Read More", "", "", "Microsoft’s MSFT fourth-quarter fiscal 2023 results, scheduled to be reported on Jul 25, are likely to be driven by continued yet slow growth in its cloud platform, Azure. For the fiscal fourth quarter, Microsoft expects Intelligent Cloud revenues (Azure falls under the segment) in constant currency (cc) to increase between 15% and 16% to $23.6-$23.9 billion. Microsoft warned that revenue growth from Azure, the cloud computing platform that has become one of the main engines of its business, can have quarterly variability primarily from per user business and in-period revenue recognition depending on the mix of contracts. Our model estimate", " "], "sentiments": ["positive", "positive", "negative", "neutral", "positive", "positive", "negative", "positive"], "summaries": ["Investors and analysts will be keen to know the extent to which AI-related boom is boosting sales.", "Ithaka U.S. Growth Fund returned 16.1% in second quarter 2023. The fund’s top five holdings to know its best picks in 2023", "Microsoft Corporation (: MSFT) is trading at a P/E ratio of 37.26x.", "Investors will be looking for signs of traction from artificial intelligence investments.", "All photographs subject to copyright.", "All photographs subject to copyright.", "Revenues for Intelligent Cloud to grow 15%- 16% in constant currency.", "All photographs subject to copyright."]}, "TXN": {"name": ["Texas Instruments Incorporated (<b>TXN</b>) Stock Price and Analyst Predictions", "Texas Instruments (<b>TXN</b>) Q2 Earnings: What To Expect", "A Look Into Texas Instruments&#39; (NASDAQ:<b>TXN</b>) Impressive Returns On Capital", "What&#39;s in the Offing for Texas Instruments (<b>TXN</b>) in Q2 Earnings?", "Unusual Call Option Trade in Texas Instruments (<b>TXN</b>) Worth $1,995.00K", "Rs 100-500 Crore Illegal <b>Txn</b>: Rajendra Gudha Corners Gehlot With Explosive &#39;Red Diary&#39;", "Texas Instruments Incorporated (<b>TXN</b>) May Have A Gold Mine.", "Ahead Of Semiconductor Earnings, Analysts Expect AI To Serve As &#39;Shining Pillar&#39; To Guide Through Muted Chip Demand", "Interesting <b>TXN</b> Put And Call Options For August 11th"], "description": ["Texas Instruments Incorporated (NASDAQ: TXN) has a price-to-earnings ratio that is above its average at 20.68x. and a 36-month beta value of 1.01. Opinions on the stock are mixed, with 9 analysts rating it as a “buy,", "Real-time index price for S&amp;P Midcap 400 (IDX), along with buy or sell indicators, analysis, charts, historical performance, news and more", "Did you know there are some financial metrics that can provide clues of a potential multi-bagger? Amongst other", "Texas Instruments&#39; (TXN) second-quarter 2022 results are likely to reflect the adverse effects of inventory reduction on Analog and Embedded Processing segments.", "On July 21, 2023 at 15:50:03 ET an unusually large $1,995.00K block of Call contracts in Texas Instruments (<b>TXN</b>) was bought, with a strike price of $200.00 / share, expiring in 182 day(s) (on January 19, 2024). Fintel tracks all large options trades ...", "Sacked minister Rajendra Singh Gudha rocked the Rajasthan Assembly on Monday (July 24) with his explosive &#39;Red diary.&#39;", "Texas Instruments Incorporated (NASDAQ:TXN) price on Friday, July 21, rose 2.45% above its previous day’s close as an upside momentum from buyers pushed the stock’s value to $184.32. A look at the stock’s price movement,", "Morgan Stanley analyst Joseph Moore noted NXP outperformed its analog peers year-to-date due to end-market positioning and proactive inventory management. The analyst said investors will likely look forward to second-half execution as end market recovery remains muted.", "Investors in Texas Instruments Inc. (Symbol: <b>TXN</b>) saw new options begin trading today, for the August 11th expiration. At Stock Options Channel, our YieldBoost formula has looked up and down the ..."], "datePublished": ["2023-07-24T12:39:00.0000000Z", "2023-07-24T14:23:00.0000000Z", "2023-07-23T12:00:00.0000000Z", "2023-07-20T14:53:00.0000000Z", "2023-07-23T03:17:00.0000000Z", "2023-07-24T08:30:00.0000000Z", "2023-07-22T15:36:00.0000000Z", "2023-07-24T16:30:00.0000000Z", "2023-06-29T16:24:00.0000000Z"], "url": ["https://newsheater.com/2023/07/24/texas-instruments-incorporated-txn-stock-price-and-analyst-predictions-2/", "https://www.theglobeandmail.com/investing/markets/indices/IDX/pressreleases/18736219/texas-instruments-txn-q2-earnings-what-to-expect/", "https://finance.yahoo.com/news/look-texas-instruments-nasdaq-txn-120036161.html", "https://finance.yahoo.com/news/whats-offing-texas-instruments-txn-145300746.html", "https://www.msn.com/en-us/money/companies/unusual-call-option-trade-in-texas-instruments-txn-worth-dollar199500k/ar-AA1ecS2j", "https://www.republicworld.com/india-news/politics/rs-100-500-crore-illegal-txn-rajendra-gudha-corners-gehlot-with-explosive-red-diary-articleshow.html", "https://stocksregister.com/2023/07/22/texas-instruments-incorporated-txn-may-have-a-gold-mine/", "https://markets.businessinsider.com/news/stocks/ahead-of-semiconductor-earnings-analysts-expect-ai-to-serve-as-shining-pillar-to-guide-through-muted-chip-demand-1032471037", "https://www.nasdaq.com/articles/interesting-txn-put-and-call-options-for-august-11th"], "texts": ["Texas Instruments Incorporated (NASDAQ: TXN) has a price-to-earnings ratio that is above its average at 20.68x. and a 36-month beta value of 1.01. Opinions on the stock are mixed, with 9 analysts rating it as a “buy,” 1 as “overweight,” 20 as “hold,” and 3 as “sell.” The average price predicted for Texas Instruments Incorporated (TXN) by analysts is $184.96, which is -$1.9 below the current market price. The public float for TXN is 905.70M, and at present, short sellers hold a 1.60% of that float. On July 24, 2023, the average trading volume of TXN was 5.05M shares. Top", "Analog chip manufacturer Texas Instruments (NASDAQ:TXN) will be reporting earnings tomorrow after the bell. Here's what to expect. Last quarter Texas Instruments reported revenues of $4.38 billion, down 10.7% year on year, in line with analyst expectations. It was a weak quarter for the company, with underwhelming revenue guidance for the next quarter and an increase in inventory levels. Is Texas Instruments buy or sell heading into the earnings? Read our full analysis here, it's free. This quarter analysts are expecting Texas Instruments's revenue to decline 16.1% year on year to $4.37 billion, a deceleration on the 13.8% year-over-year decrease", "Did you know there are some financial metrics that can provide clues of a potential multi-bagger? Amongst other things, we'll want to see two things; firstly, a growing return on capital employed (ROCE) and secondly, an expansion in the company's amount of capital employed. Ultimately, this demonstrates that it's a business that is reinvesting profits at increasing rates of return. Ergo, when we looked at the ROCE trends at Texas Instruments (NASDAQ:TXN), we liked what we saw. What Is Return On Capital Employed (ROCE)? For those who don't know, ROCE is a measure of a company's yearly pre-tax profit (its", "Texas Instruments Incorporated TXN is scheduled to report second-quarter 2023 results on Jul 25. For second-quarter 2023, Texas Instruments expects revenues between $4.17 billion and $4.53 billion. The Zacks Consensus Estimate is pegged at $4.36 billion, suggesting a decline of 16.4% from the year-ago quarter’s reported figure. Management expects earnings of $1.62-$1.88 per share for the quarter under review. The consensus mark is pegged at $1.76 per share, indicating a fall of 28.2% from the prior-year quarter’s reported figure. The estimate has remained unchanged over the past 30 days. TXN’s earnings surpassed the Zacks Consensus Estimate in all the trailing", "", "Sacked minister Rajendra Singh Gudha rocked the Rajasthan Assembly on Monday (July 24) with his explosive 'Red diary' that allegedly contained records of illegal transactions performed by the state government to the tune of Rs 100 to 500 crore. In a shocking revelation, Gudha claimed that Rajasthan CM Ashok Gehlot reached out to him multiple times for retrieving out the 'red diary' from the premises of minister Dharmendra Rathod, which was under the Income Tax raids at that time. He waved the 'red diary' in the Assembly, attempting to table it in front of the speaker. He was attacked by", "Texas Instruments Incorporated (NASDAQ:TXN) price on Friday, July 21, rose 2.45% above its previous day’s close as an upside momentum from buyers pushed the stock’s value to $184.32. A look at the stock’s price movement, the close in the last trading session was $179.92, moving within a range at $181.355 and $185.57. The PE ratio in trailing twelve months stood at 20.68. Turning to its 52-week performance, $186.30 and $145.97 were the 52-week high and 52-week low respectively. Overall, TXN moved 8.12% over the past month. Top 5 AI Stocks to Buy for 2023 The artificial intelligence (AI) revolution is", "The tech earnings season gets started in earnest this week and besides AI-levered bellwether stocks such as Alphabet, Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL) and Microsoft Corp (NASDAQ:MSFT), the Street's focus will also rest on a few large and mid-cap semiconductor and semi-equipment earnings on tap. The Chip Earnings Schedule: Tuesday NXP Semiconductors N.V. (NASDAQ:NXPI) (after the market close) Texas Instruments, Inc. (NASDAQ:TXN) (after the market close) Wednesday Silicon Laboratories Inc. (NASDAQ:SLAB) (before the market open) Terdyne Inc. (NASDAQ:TER) (after the market close) Lam Research Corporation (NASDAQ:LRCX) (after the market close) Thursday Intel Corporation (NASDAQ:INTC) (after the market close) KLA Corp. (NASDAQ:KLAC) (after", "Investors in Texas Instruments Inc. (Symbol: TXN) saw new options begin trading today, for the August 11th expiration. At Stock Options Channel, our YieldBoost formula has looked up and down the TXN options chain for the new August 11th contracts and identified one put and one call contract of particular interest. The put contract at the $170.00 strike price has a current bid of $3.70. If an investor was to sell-to-open that put contract, they are committing to purchase the stock at $170.00, but will also collect the premium, putting the cost basis of the shares at $166.30 (before broker"], "sentiments": ["positive", "negative", "neutral", "neutral", "positive", "negative", "positive", "positive", "neutral"], "summaries": ["Shares of Texas Instruments are trading at a P/E ratio of 23.98x.", "Analysts are expecting slower revenue decline this quarter.", "Return on Capital Employed (ROCE) is a measure of Proceeds relative to assets.", "Management expects second-quarter revenues to decline 16.4% from year-ago quarter.", "All photographs subject to copyright.", "Sacked minister Rajendra Singh Gudha rocked the Rajasthan Assembly with explosive 'Red diary'.", "A look at the stock’s price movement, close in last trading session was $184.32.", "Earnings for several large and mid-cap firms are on tap.", "Below is a chart showing the one put and one call contract of particular interest."]}}