{"AAPL": {"name": ["Here’s Why You Should Hold Apple (<b>AAPL</b>) for the Long-Term", "Thinking Of Buying Apple Inc. (NASDAQ: <b>AAPL</b>) Stock? Here’s What You Need To Know", "<b>AAPL</b> Stock Hits Record High amid New AI Developments", "At US$193, Is It Time To Put Apple Inc. (NASDAQ:<b>AAPL</b>) On Your Watch List?", "Unusual Put Option Trade in Apple (<b>AAPL</b>) Worth $874.38K", "Apple (<b>AAPL</b>) Stock Rises Briefly Following Rumors of Internal Generative AI Chatbot Rivalling ChatGPT", "New Buy Rating for Apple (<b>AAPL</b>), the Technology Giant", "Investment Committee Disclosures"], "description": ["Wedgewood Partners, an investment management company, released its “Wedgewood Partners Large Cap Focused Growth Fund” second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter,", "Apple Inc. (NASDAQ:AAPL) price on Friday, July 21, fall -0.62% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $191.94. A look at the stock’s price movement,", "If the space for artificial intelligence stocks is looking a bit crowded, prepare for a little more claustrophobia. Apple (NASDAQ:AAPL) is", "Join A Paid User Research Session You’ll receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here", "On July 20, 2023 at 15:15:22 ET an unusually large $874.38K block of Put contracts in Apple (<b>AAPL</b>) was bought, with a strike price of $195.00 / share, expiring in 22 day(s) (on August 11, 2023). Fintel tracks all large options trades, and the premium spent ...", "Reportedly, select staff have access to the developing Apple AI chatbot the company plans will rival ChatGPT and Bard.", "Citi analyst Atif Malik maintained a Buy rating on Apple (AAPL – Research Report) today and set a price target of $240.00. The", "The &quot;Halftime Report&quot; investment committee&#39;s current list of disclosures. Stay up-to-date with the committee&#39;s latest buys, sells, and trades. To learn more about our committee members follow the ..."], "datePublished": ["2023-07-20T10:34:00.0000000Z", "2023-07-22T14:03:00.0000000Z", "2023-07-19T17:09:51.0000000Z", "2023-07-21T14:00:00.0000000Z", "2023-07-22T15:38:00.0000000Z", "2023-07-20T08:16:00.0000000Z", "2023-07-20T09:55:00.0000000Z", "2023-07-21T16:58:00.0000000Z"], "url": ["https://news.yahoo.com/why-hold-apple-aapl-long-103432783.html", "https://stocksregister.com/2023/07/22/thinking-of-buying-apple-inc-nasdaq-aapl-stock-heres-what-you-need-to-know/", "https://www.msn.com/en-us/money/markets/aapl-stock-hits-record-high-amid-new-ai-developments/ar-AA1e54Nj", "https://finance.yahoo.com/news/us-193-time-put-apple-140024913.html", "https://www.msn.com/en-us/money/markets/unusual-put-option-trade-in-apple-aapl-worth-87438k/ar-AA1ed66T", "https://www.coinspeaker.com/apple-stock-generative-ai-chatbot/", "https://markets.businessinsider.com/news/stocks/new-buy-rating-for-apple-aapl-the-technology-giant-1032461851", "https://www.cnbc.com/2022/03/03/halftime-report-investment-committee-disclosures.html"], "texts": ["Wedgewood Partners, an investment management company, released its \"Wedgewood Partners Large Cap Focused Growth Fund\" second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter, Wedgewood Composite’s net return was 8.1% compared to the Standard & Poor’s 8.7%, Russell 1000 Growth Index’s 12.8%, and Russell 1000 Value Index’s 4.1% return for the same period. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Wedgewood Partners Large Cap Focused Growth Fund highlighted stocks like Apple Inc. (NASDAQ:AAPL) in the second quarter 2023 investor", "Apple Inc. (NASDAQ:AAPL) price on Friday, July 21, fall -0.62% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $191.94. A look at the stock’s price movement, the close in the last trading session was $193.13, moving within a range at $191.23 and $194.97. The beta value (5-Year monthly) was 1.29 while the PE ratio in trailing twelve months stood at 32.61. Turning to its 52-week performance, $198.23 and $124.17 were the 52-week high and 52-week low respectively. Overall, AAPL moved 4.34% over the past month. Top 5 AI Stocks to Buy for", "", "Let's talk about the popular Apple Inc. (NASDAQ:AAPL). The company's shares saw a significant share price rise of over 20% in the past couple of months on the NASDAQGS. With many analysts covering the large-cap stock, we may expect any price-sensitive announcements have already been factored into the stock’s share price. But what if there is still an opportunity to buy? Let’s examine Apple’s valuation and outlook in more detail to determine if there’s still a bargain opportunity. See our latest analysis for Apple What's The Opportunity In Apple? The share price seems sensible at the moment according to my", "", "Reportedly, select staff have access to the developing Apple AI chatbot the company plans will rival ChatGPT and Bard. Tech giant Apple Inc (NASDAQ: AAPL) is reportedly developing an artificial intelligence (AI) generative pre-trained transformer (GPT) model to rival OpenAI’s ChatGPT. Following a news report initially published by Bloomberg, Apple stock briefly rose but ended the day up by 0.71%, at $195.1. As of press time, AAPL has fallen a further 0.64% from its close and is at $193.75 in after-hours trading. In the last year, AAPL has seen a 27.48% rise and more than 50% since January. Unofficially called", "Citi analyst Atif Malik maintained a Buy rating on Apple (AAPL – Research Report) today and set a price target of $240.00. The company’s shares closed yesterday at $195.10. According to TipRanks, Malik is a top 100 analyst with an average return of 30.7% and a 71.70% success rate. Malik covers the Technology sector, focusing on stocks such as Nvidia, Apple, and Wolfspeed. The word on The Street in general, suggests a Strong Buy analyst consensus rating for Apple with a $195.67 average price target, a 0.29% upside from current levels. In a report released on July 18, Jefferies also", "Josh Brown Disclosures as of 7/20/23 (1:00 PM ET): Josh is long stock AAPL, AMZN, AOS, BRK.B, BROS, CG, CHPT, CRWD, GOOGL, IEO, INVH, ITA, JPM, LYV, MTTR, NEE, NVDA, SHAK, TOST, UBER. Karen Firestone Disclosures as of 7/20/23 (1:00 PM ET): Kari is long AAPL, ADBE, ADSK, ALGN, AMT, AMZN, AWK, AXP, BAH, BKNG, BX, CHTR, CRM, FTV, GOOGL, HD, HQY, INMD, KMX, META, MSFT, NEE, ORLY, PYPL, SCHW, SHW, SPGI, TMO, UNH, V, WAB, WCN. Jenny Harrington Disclosures as of 7/19/23 (1:00 PM ET): Jenny’s firm is long AIN, AMBP, APTV, AXAHY, AXP, BAESY, BASFY, BGS, BMY, CARR,"], "sentiments": ["neutral", "negative", "positive", "positive", "positive", "positive", "positive", "neutral"], "summaries": ["In the second quarter, the fund returned 8.1% compared to S&P, Russell 1000 Growth Index, and Russell 1000 Value Index.", "Shares of Apple closed at $191.94 down -0.62% in last trading session.", "All photographs subject to copyright.", "Is the share price ‘sensible’ at the moment?", "All photographs subject to copyright.", "Tech giant is developing an artificial intelligence model to rival OpenAI’s ChatGPT. Report says select staff have access to the technology", "Atif Malik has a new Buy rating on Apple with a price target of $240.", "Disclosures as of 7/20/23 (1:00 PM ET)."]}, "AVGO": {"name": ["How AI Chip Growth Is Pushing Broadcom, Stock Of The Day, Toward A Buy Point", "Steven Romick Cuts Back Alphabet Stakes, Adds To Heineken And Douglas Emmett", "Broadcom Inc. (<b>AVGO</b>) Sitting On The Launch Pad, Waiting For Long Term Investors", "Broadcom Inc. (<b>AVGO</b>) Dips More Than Broader Markets: What You Should Know", "3 Cheap Semiconductor Stocks to Buy Before They Bounce Back", "Guru Fundamental Report for <b>AVGO</b>", "Broadcom&#39;s acquisition of VMware gets provisional clearance in UK", "Guru Fundamental Report for <b>AVGO</b>"], "description": ["Broadcom is the IBD Stock Of The Day as the chipmaker and infrastructure software provider moves closer to completing its acquisition of VMware.", "During the quarter, Romick also sold out of several stocks, including Churchill Capital Corp VII ( CVII.U, Financial) and Metals Acquisition Ltd. ( MTAL, Financial ), and cut back his investments in Heidelberg Materials AG ( XTER:HEI, Financial ), Netflix NFLX -2.3% Inc. ( NFLX, Financial) and Holcim Ltd. ( XSWX:HOLN, Financial ).", "Broadcom Inc. (NASDAQ:AVGO) price on Thursday, July 20, fall -1.45% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $888.34. A look at the stock’s price movement,", "Broadcom Inc. (<b>AVGO</b>) closed at $888.34 in the latest trading session, marking a -1.45% move from the prior day. This change lagged the S&amp;P 500&#39;s daily loss of 0.68%. At the same time, the Dow added 0.47%, and the tech-heavy Nasdaq lost 3.19%. Heading into ...", "InvestorPlace - Stock Market News, Stock Advice &amp; Trading Tips Investing in cheap semiconductor stocks offers significant potential for", "Below is Validea&#39;s guru fundamental report for BROADCOM INC (<b>AVGO</b>). Of the 22 guru strategies we follow, <b>AVGO</b> rates highest using our Twin Momentum Investor model based on the published strategy ...", "The U.K.&#39;s Competition and Markets Authority ((CMA)) has provisionally cleared Broadcom&#39;s (AVGO) proposed acquisition of VMware (VMW). Read more here", "Below is Validea&#39;s guru fundamental report for BROADCOM INC (<b>AVGO</b>). Of the 22 guru strategies we follow, <b>AVGO</b> rates highest using our Twin Momentum Investor model based on the published strategy ..."], "datePublished": ["2023-07-21T18:39:00.0000000Z", "2023-07-20T22:00:00.0000000Z", "2023-07-21T11:41:00.0000000Z", "2023-07-20T21:45:00.0000000Z", "2023-07-17T02:38:00.0000000Z", "2023-07-16T13:37:00.0000000Z", "2023-07-19T12:35:14.0000000Z", "2023-07-09T13:32:00.0000000Z"], "url": ["https://www.msn.com/en-us/money/topstocks/how-ai-chip-growth-is-pushing-broadcom-stock-of-the-day-toward-a-buy-point/ar-AA1ebldd", "https://www.forbes.com/sites/gurufocus/2023/07/20/steven-romick-cuts-back-alphabet-stakes-adds-to-heineken-and-douglas-emmett/", "https://stocksregister.com/2023/07/21/broadcom-inc-avgo-sitting-on-the-launch-pad-waiting-for-long-term-investors/", "https://www.msn.com/en-us/money/topstocks/broadcom-inc-avgo-dips-more-than-broader-markets-what-you-should-know/ar-AA1e8KhZ", "https://markets.businessinsider.com/news/stocks/3-cheap-semiconductor-stocks-to-buy-before-they-bounce-back-1032449278", "https://www.nasdaq.com/articles/guru-fundamental-report-for-avgo-45", "https://www.msn.com/en-us/money/markets/broadcoms-acquisition-of-vmware-gets-conditional-approval-in-uk/ar-AA1e40lJ", "https://www.nasdaq.com/articles/guru-fundamental-report-for-avgo-43"], "texts": ["", " ", "Broadcom Inc. (NASDAQ:AVGO) price on Thursday, July 20, fall -1.45% below its previous day’s close as a downside momentum from buyers pushed the stock’s value to $888.34. A look at the stock’s price movement, the close in the last trading session was $901.37, moving within a range at $886.00 and $906.9999. The beta value (5-Year monthly) was 1.12 while the PE ratio in trailing twelve months stood at 27.80. Turning to its 52-week performance, $921.78 and $415.07 were the 52-week high and 52-week low respectively. Overall, AVGO moved 2.34% over the past month. Top 5 AI Stocks to Buy for", "", "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Investing in cheap semiconductor stocks offers significant potential for growth driven by increasing demand for automotive, energy storage, robotics, artificial intelligence, and machine learning. The global semiconductor market has seen tremendous growth in recent years, projected to become a trillion-dollar industry by 2030 (McKinsey, 2022). This is a result of high single-digit to low double-digit revenue growth and EBITDA margin expansions. With Nvidia reaching a trillion-dollar valuation in 2023, these 3 semiconductor stocks have major room for growth over the next decade. Below are my top three high-potential semiconductor stocks", "Below is Validea's guru fundamental report for BROADCOM INC (AVGO). Of the 22 guru strategies we follow, AVGO rates highest using our Twin Momentum Investor model based on the published strategy of Dashan Huang. This momentum model looks for a combination of fundamental momentum and price momentum. BROADCOM INC (AVGO) is a large-cap growth stock in the Semiconductors industry. The rating using this strategy is 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates", "", "Below is Validea's guru fundamental report for BROADCOM INC (AVGO). Of the 22 guru strategies we follow, AVGO rates highest using our Twin Momentum Investor model based on the published strategy of Dashan Huang. This momentum model looks for a combination of fundamental momentum and price momentum. BROADCOM INC (AVGO) is a large-cap growth stock in the Semiconductors industry. The rating using this strategy is 100% based on the firm’s underlying fundamentals and the stock’s valuation. A score of 80% or above typically indicates that the strategy has some interest in the stock and a score above 90% typically indicates"], "sentiments": ["positive", "positive", "negative", "positive", "positive", "neutral", "positive", "neutral"], "summaries": ["All photographs subject to copyright.", "All photographs subject to copyright.", "Shares of the firm fell -1.45% to close at $888.34.", "All photographs subject to copyright.", "Top 3 semiconductor stocks with room for growth over next decade.", "AVGO is a large-cap growth stock in Semiconductors industry.", "All photographs subject to copyright.", "AVGO is a large-cap growth stock in Semiconductors industry."]}, "DOCN": {"name": ["DigitalOcean Holdings, Inc. (<b>DOCN</b>) Outpaces Stock Market Gains: What You Should Know", "Longtime tech entrepreneur Anshu Agarwal joins venture firm to ‘let founders do their magic’", "DigitalOcean Holdings Inc. [<b>DOCN</b>] short interest falls, dropping by 13.04 million million shares", "Barclays Maintains DigitalOcean Holdings (<b>DOCN</b>) Overweight Recommendation", "DigitalOcean Holdings, Inc. (NYSE:<b>DOCN</b>) Is About To Turn The Corner", "Expert Ratings for DigitalOcean Holdings"], "description": ["DigitalOcean Holdings, Inc. (<b>DOCN</b>) closed the most recent trading day at $48.76, moving +0.45% from the previous trading session. This change outpaced the S&amp;P 500&#39;s 0.03% gain on the day. Elsewhere, the Dow gained 0.01%, while the tech-heavy Nasdaq lost 1.37%. Heading into today, shares of the company had gained 24.33% over the past month, outpacing the Computer and Technology sector&#39;s gain of ...", "East Coast-based venture-capital firm Converge named Anshu Agarwal as a general partner, thereby establishing a base camp in Silicon Valley.", "As published in a research note from Piper Sandler on June 22, 2023, DigitalOcean Holdings Inc. [DOCN] has been rated down from a Neutral to an Underweight and the price target has been revised to $35. This represents a -38.69% premium over Thursday’s closing price.", "Fintel reports that on July 19, 2023, Barclays maintained coverage of DigitalOcean Holdings (NYSE:DOCN) with a Overweight recommendation. Analyst Price Forecast Suggests 17.94% Downside As of July 6,", "According to the 13 industry analysts covering DigitalOcean Holdings, the consensus is that breakeven is near. They anticipate the company to incur a final loss in 2022, before generating positive profits of US$7.", "Below is a summary of how these 4 analysts rated DigitalOcean Holdings over the past 3 months. The greater the number of bullish ratings, the more positive analysts are on the stock and the greater the number of bearish ratings, the more negative analysts are on the stock"], "datePublished": ["2023-07-21T22:00:00.0000000Z", "2023-07-21T12:30:00.0000000Z", "2023-07-21T21:47:00.0000000Z", "2023-07-19T19:36:20.0000000Z", "2023-07-13T16:56:00.0000000Z", "2023-07-12T21:59:00.0000000Z"], "url": ["https://www.msn.com/en-us/money/markets/digitalocean-holdings-inc-docn-outpaces-stock-market-gains-what-you-should-know/ar-AA1ebLGk", "https://www.marketwatch.com/story/longtime-tech-entrepreneur-anshu-agarwal-joins-venture-firm-to-let-founders-do-their-magic-bdd5e686", "https://knoxdaily.com/2023/07/21/digitalocean-holdings-inc-docn-short-interest-falls-dropping-by-13-04-million-million-shares/", "https://www.msn.com/en-us/money/smallbusiness/barclays-maintains-digitalocean-holdings-docn-overweight-recommendation/ar-AA1e5pyT", "https://finance.yahoo.com/news/digitalocean-holdings-inc-nyse-docn-165628417.html", "https://markets.businessinsider.com/news/stocks/expert-ratings-for-digitalocean-holdings-1032442374"], "texts": ["", "Longtime Silicon Valley entrepreneur Anshu Agarwal has decided it’s time to be a mentor rather than an operator. In 2021, DigitalOcean Holdings Inc. DOCN, +0.45% acquired Agarwal’s cloud company, Nimbella, the fifth startup in her portfolio of nearly two decades. After serving as vice president and general manager of DigitalOcean’s Serverless & Kubernetes business unit, elevating DigitalOcean to more than 600,000 customers, she was ready for a change. “When I left DigitalOcean, I could have started another company or joined an established one,” Agarwal said in an interview. “I know what founders want after years as an operator.” On Thursday,", "Investors can expect a company’s stock to rise or fall based on the buying and selling of stock by its insiders. DigitalOcean Holdings Inc. shares valued at $276,540 were sold by Guy Jeffrey Scott on Jul 10. At $46.09 per share, Guy Jeffrey Scott sold 6,000 shares. The insider’s holdings dropped to 144,262 shares worth approximately $7.0 million following the completion of this transaction. Top 5 AI Stocks to Buy for 2023 The artificial intelligence (AI) revolution is already here. And it's about to change everything we know about everything. According to Grand View Research, the global AI boom could", "", "With the business potentially at an important milestone, we thought we'd take a closer look at DigitalOcean Holdings, Inc.'s (NYSE:DOCN) future prospects. DigitalOcean Holdings, Inc., through its subsidiaries, operates a cloud computing platform in North America, Europe, Asia, and internationally. The US$4.3b market-cap company posted a loss in its most recent financial year of US$24m and a latest trailing-twelve-month loss of US$41m leading to an even wider gap between loss and breakeven. The most pressing concern for investors is DigitalOcean Holdings' path to profitability – when will it breakeven? In this article, we will touch on the expectations for the", "Within the last quarter, DigitalOcean Holdings (NYSE:DOCN) has observed the following analyst ratings: Bullish Somewhat Bullish Indifferent Somewhat Bearish Bearish Total Ratings 1 1 1 1 0 Last 30D 1 0 0 0 0 1M Ago 0 0 0 1 0 2M Ago 0 0 0 0 0 3M Ago 0 1 1 0 0 According to 4 analyst offering 12-month price targets in the last 3 months, DigitalOcean Holdings has an average price target of $46.5 with a high of $63.00 and a low of $35.00. Below is a summary of how these 4 analysts rated DigitalOcean Holdings over"], "sentiments": ["positive", "positive", "positive", "positive", "positive", "neutral"], "summaries": ["All photographs subject to copyright.", "DigitalOcean acquired Agarwal’s Nimbella in 2021", "Guy Jeffrey Scott sold 6,000 shares at $46.09 per share.", "All photographs subject to copyright.", "Check out our latest analysis for DigitalOcean Holdings", "Wall Street analysts have a Bullish view on the stock, with a consensus target price of $46.5."]}, "IBM": {"name": ["Red Hat saved <b>IBM</b>’s bacon this quarter", "<b>IBM</b> reports earnings beat, but misses on revenue", "Is <b>IBM</b> Stock a Buy Now?", "Why <b>IBM</b> Stock Popped After Earnings", "<b>IBM</b>&#39;s Double-Digit Growth In TP And Data &amp; AI Not Sustainable, Predicts Analyst", "<b>IBM</b> FlashSystem 5045 Arrives With Enhanced Data Resilience Capabilities", "Attention, startups. <b>IBM</b> has $16 billion to go deal shopping", "Tech Moves: T-Mobile adds <b>IBM</b> CFO to board; Tencent data science leader joins Seattle startup", "<b>IBM</b> misses on revenue but sees AI leading a new round of growth", "<b>IBM</b>’s Watson rebooted as a secure AI alternative"], "description": ["IBM reported earnings this week, which weren&#39;t exactly stellar, but without Red Hat&#39;s revenue, it could have been far worse.", "IBM&#39;s data and artificial intelligence products showed the fastest expansion, growing 10% from a year earlier, the company said.", "<b>IBM</b> turned in a mixed second-quarter report. Its revenue growth cooled off again, but it reiterated its full-year forecast. Its low valuation, high yield, and stabilizing growth could attract more investors. <b>IBM</b>&#39;s stock dipped 1% during after-hours trading ...", "Analysts had forecast IBM would earn only $2.01 per share in &quot;adjusted&quot; profits for the quarter, and IBM beat that guess with a stick, earning $2.18 per share. Sales that were supposed to approach $15.6 billion, however, fell just short of that mark, coming in at $15.5 billion instead.", "BMO Capital Markets analyst Keith Bachman reiterated the Market Perform rating on International Business Machines Corporation (NYSE: IBM),", "IBM releases its new entry-level FlashSystem 5045, solidifying IBM’s data protection capabilities across its entire FlashSystem enterprise storage portfolio.", "IBM is hunting for the next deal – specifically in hybrid cloud, automation, cybersecurity and a new sweet spot: artificial intelligence.", "— T-Mobile announced Thursday that IBM CFO James Kavanaugh joined its board of directors. Kavanaugh joined IBM nearly three decades ago and became CFO in 2018. Prior to IBM, Kavanaugh was CFO for AT&amp;T’s Americas global services.", "“IBM is hitting the double headwinds of a slowing economy and challenging currency exchange rate developments,” said Holger Mueller, principal analyst at Constellation Research Inc. “The good news is that Red Hat is holding up with 11% growth and IBM is gaining a second leg from the strong momentum of its data and AI portfolio.”", "IBM hopes its watsonx studio will get it back into the AI conversation. It’s last splashy foray, Watson, was once billed as AI breakthrough for healthcare, accounting, cybersecurity and for beating Jeopardy! superstars like Ken Jennings. Today, as its lower-case “w” suggests, IBM’s moonshot ambitions have been scuttled, for now."], "datePublished": ["2023-07-21T18:25:00.0000000Z", "2023-07-19T20:57:00.0000000Z", "2023-07-22T11:45:00.0000000Z", "2023-07-20T17:47:07.0000000Z", "2023-07-20T21:07:00.0000000Z", "2023-07-20T18:06:00.0000000Z", "2023-07-21T19:12:00.0000000Z", "2023-07-21T17:47:21.0000000Z", "2023-07-20T16:53:00.0000000Z", "2023-07-20T20:51:00.0000000Z"], "url": ["https://techcrunch.com/2023/07/21/red-hat-ibm-earnings/", "https://www.cnbc.com/2023/07/19/ibm-q2-earnings-report-2023.html", "https://www.fool.com/investing/2023/07/22/is-ibm-stock-a-buy-now/", "https://www.msn.com/en-us/money/topstocks/why-ibm-stock-popped-after-earnings/ar-AA1e8myM", "https://markets.businessinsider.com/news/stocks/ibm-s-double-digit-growth-in-tp-and-data-ai-not-sustainable-predicts-analyst-1032463777", "https://www.forbes.com/sites/stevemcdowell/2023/07/20/ibm-flashsystem-5045-arrives-with-enhanced-data-resilience-capabilities/", "https://www.bizjournals.com/triangle/inno/stories/news/2023/07/21/startups-ibm-acquisitions-mergers.html", "https://www.msn.com/en-us/money/companies/tech-moves-t-mobile-adds-ibm-cfo-to-board-tencent-data-science-leader-joins-seattle-startup/ar-AA1ebkdQ", "https://siliconangle.com/2023/07/19/ibm-misses-revenue-sees-ai-leading-new-round-growth/", "https://www.scmagazine.com/news/emerging-technology/ibm-watson-rebooted-ai-alternative"], "texts": ["IBM reported earnings this week, and if we’re being honest, the results were rather uninspiring. The company generated revenue of around $15.5 billion, down a disappointing 0.4% from its year-ago result. However, even inside its less-than-stellar report, there were some favorable tidbits for the well-known tech giant. On the negative side, IBM’s infrastructure business is deep in the doldrums with revenue down 14.6% to $3.6 billion, compared to year-ago metrics. That overall loss includes IBM Z Systems, the company’s mainframe business, falling 30% on its own. Z Systems has been pretty solid for the company in the past, so it’s", "IBM Chairman and CEO Arvind Krishna appears on a panel session at the World Economic Forum in Davos, Switzerland, Jan. 17, 2023. IBM reported second-quarter earnings Wednesday that topped analysts' estimates as the company expanded its gross margin. Revenue missed consensus estimates. Shares of IBM were little changed in extended trading after the report. Here's how the company did: Earnings: $2.18, adjusted, versus $2.01 per share expected, according to Refinitiv. $2.18, adjusted, versus $2.01 per share expected, according to Refinitiv. Revenue: $15.48 billion, versus $15.58 billion expected, according to Refinitiv. Net income for the quarter rose 13% to $1.6 billion", "IBM (IBM 0.41%) posted its second-quarter earnings report on July 19. The tech giant's revenue declined 0.4% year over year (but rose 0.4% on constant currency terms) to $15.5 billion, which missed analysts' expectations by $70 million. Its adjusted EPS declined 6% to $2.18 but still cleared the consensus forecast by $0.76. IBM's stock dipped 1% during after-hours trading following that report, and it's declined about 5% year to date. Neither the bulls nor the bears seem too enthusiastic about IBM -- but is it worth buying as a long-term investment right now? IBM's growth is still cooling off After", "", "BMO Capital Markets analyst Keith Bachman reiterated the Market Perform rating on International Business Machines Corporation (NYSE:IBM), raising the price target to $152 from $150. IBM reported second-quarter results recently, where earnings of $2.18 per share were ahead of the $2.01 Street estimate on revenues of $15.47 billion, which missed the $15.57 billion consensus estimate. In the software segment, the analyst thinks the upside was driven by two areas – transaction processing (TP) and Data & AI. Bachman had expected mid-single-digit growth in TP and low single-digit growth in Data & AI, and both generated double-digit growth of 10% to", " ", " ", "", " ", "IBM jumped into the generative artificial intelligence rumble last week with the roll-out of watsonx. The platform is a far cry from Big Blue’s Watson “cognitive computing” platform, first launched over a decade ago. Watson’s prodigy is now being billed as a “secure” and “trusted” AI development platform. IBM hopes its watsonx studio will get it back into the AI conversation. It’s last splashy foray, Watson, was once billed as AI breakthrough for healthcare, accounting, cybersecurity and for beating Jeopardy! superstars like Ken Jennings. Today, as its lower-case “w” suggests, IBM’s moonshot ambitions have been scuttled, for now. \"This is"], "sentiments": ["negative", "positive", "positive", "positive", "positive", "positive", "positive", "positive", "positive", "positive"], "summaries": ["Technology giant’s infrastructure business is in decline. Z Systems has been pretty solid in the past.", "Second-quarter earnings topped analysts' estimates as company expanded gross margin. Revenue missed estimates as the company expanded its gross margin", "Tech giant's revenue declined 0.4% year over year, but rose 0.4% on constant currency terms.", "All photographs subject to copyright.", "Analyst sees upside in two areas: Transaction processing and Data & AI.", "All photographs subject to copyright.", "All photographs subject to copyright.", "All photographs subject to copyright.", "All photographs subject to copyright.", "Platform is a far cry from Watson’s ‘cognitive computing’ debut. Big Blue hopes it can get back into the AI conversation"]}, "MSFT": {"name": ["Unusual Call Option Trade in Microsoft (<b>MSFT</b>) Worth $9,084.76K", "<b>MSFT</b> Stock Alert: Nancy Pelosi Has Made $12.5 MILLION on Microsoft in 2023", "Here’s Why Investors Love Microsoft Corporation (<b>MSFT</b>)", "Microsoft (<b>MSFT</b>) Hits All-Time High: Can the Rally Last?", "Microsoft Earnings Forecast &amp; Preview: The 2023 <b>MSFT</b> Stock Rally", "Microsoft Corporation (<b>MSFT</b>) Generated Strong Returns in Q2", "JP Morgan Maintains Microsoft (<b>MSFT</b>) Overweight Recommendation", "Wedbush Reiterates Microsoft (<b>MSFT</b>) Outperform Recommendation"], "description": ["ET an unusually large $9,084.76K block of Call contracts in Microsoft (MSFT) was sold, with a strike price of $250.00 / share, expiring in 427 day(s) (on September 20, 2024). Fintel tracks all large options trades,", "Nancy Pelosi has taken significant profits from her Microsoft investments as the AI boom has taken off. Here&#39;s why MSFT stock isn&#39;t done yet.More From InvestorPlace Buy This $5 Stock BEFORE This Apple Project Goes Live Wall Street Titan: Here’s My #1 Stock for 2023 The $1 Investment You MUST Take Advantage of Right Now It doesn’t matter if you have $500 or $5 million.", "Wedgewood Partners, an investment management company, released its “Wedgewood Partners Large Cap Focused Growth Fund” second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter,", "Microsoft (MSFT) stock reaches an all-time high. Its latest AI venture can revolutionize the global business sector and solidify its position in the tech world.", "Our Microsoft earnings forecast and preview will cover everything from Azure&#39;s profit levels to the potential future of the Activision Blizzard merger.", "ClearBridge Investments, an investment management company, released its “ClearBridge Large Cap Growth Strategy” second quarter 2023 investor letter. A copy of the same can be downloaded here. The market’s increased concentration on generative AI pushed the mega-cap growth stocks to outperform in the quarter.", "Fintel reports that on July 19, 2023, JP Morgan maintained coverage of Microsoft ( NASDAQ:MSFT) with a Overweight recommendation.", "Fintel reports that on July 18, 2023, Wedbush reiterated coverage of Microsoft ( NASDAQ:MSFT) with a Outperform recommendation."], "datePublished": ["2023-07-22T15:37:48.0000000Z", "2023-07-20T19:21:35.0000000Z", "2023-07-20T07:56:00.0000000Z", "2023-07-19T13:03:00.0000000Z", "2023-07-20T02:18:00.0000000Z", "2023-07-10T11:18:00.0000000Z", "2023-07-19T18:40:00.0000000Z", "2023-07-18T20:27:00.0000000Z"], "url": ["https://www.msn.com/en-us/money/companies/unusual-call-option-trade-in-microsoft-msft-worth-908476k/ar-AA1ecZAL", "https://www.msn.com/en-us/money/savingandinvesting/msft-stock-alert-nancy-pelosi-has-made-125-million-on-microsoft-in-2023/ar-AA1e7WDQ", "https://finance.yahoo.com/news/why-investors-love-microsoft-corporation-075621473.html", "https://finance.yahoo.com/news/microsoft-msft-hits-time-high-130300797.html", "https://www.cmcmarkets.com/en/news-and-analysis/microsoft-earnings-forecast-preview-msft-stock", "https://news.yahoo.com/microsoft-corporation-msft-generated-strong-111834141.html", "https://www.nasdaq.com/articles/jp-morgan-maintains-microsoft-msft-overweight-recommendation-0", "https://www.nasdaq.com/articles/wedbush-reiterates-microsoft-msft-outperform-recommendation-1"], "texts": ["", "", "Wedgewood Partners, an investment management company, released its \"Wedgewood Partners Large Cap Focused Growth Fund\" second quarter 2023 investor letter. A copy of the same can be downloaded here. In the second quarter, Wedgewood Composite’s net return was 8.1% compared to the Standard & Poor’s 8.7%, Russell 1000 Growth Index’s 12.8%, and Russell 1000 Value Index’s 4.1% return for the same period. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023. Wedgewood Partners Large Cap Focused Growth Fund highlighted stocks like Microsoft Corporation (NASDAQ:MSFT) in the second quarter 2023 investor", "The tech behemoth Microsoft MSFT, lately synonymous with game-changing innovations in the AI field due to its association with OpenAI’s ChatGpt, has again dominated headlines. On Tuesday, its stock price rallied to an all-time high of $366.78. On the day, share price increased about 4%, closing at $359.49. This jump marks a 50% ascent for the year. What’s Behind the Latest Rally? Microsoft's recent announcement detailing the pricing structure for its Microsoft 365 AI subscription offering, Copilot, led to the rally, as quoted on CNBC. Copilot seamlessly integrates artificial intelligence into the beloved Office suite, such as Word, Excel and", "While analysts were calling for 2023 to be a bad year for equity markets, it has been anything but bearish and in fact has been on an absolute tear thanks to the excitement behind artificial intelligence (AI). One such AI stock that's been responsible for bringing back the tech bull market is Microsoft and its now globally recognised generative AI chatbot ChatGPT. With Microsoft reporting its upcoming financial earnings, everyone from investors to technology enthusiasts is eager to gain an insight into the company's financial performance and the potential impact on both its stock price and the market sentiment more", "ClearBridge Investments, an investment management company, released its “ClearBridge Large Cap Growth Strategy” second quarter 2023 investor letter. A copy of the same can be downloaded here. The market’s increased concentration on generative AI pushed the mega-cap growth stocks to outperform in the quarter. The strategy outperformed its benchmark the Russell 1000 Growth Index through a high-beta-driven period of mega-cap dominance. In addition, please check the fund’s top five holdings to know its best picks in 2023. ClearBridge Large Cap Growth Strategy highlighted stocks like Microsoft Corporation (NASDAQ:MSFT) in the second quarter 2023 investor letter. Headquartered in Redmond, Washington, Microsoft", "Fintel reports that on July 19, 2023, JP Morgan maintained coverage of Microsoft (NASDAQ:MSFT) with a Overweight recommendation. Analyst Price Forecast Suggests 2.53% Downside As of July 5, 2023, the average one-year price target for Microsoft is 350.38. The forecasts range from a low of 234.32 to a high of $420.00. The average price target represents a decrease of 2.53% from its latest reported closing price of 359.49. See our leaderboard of companies with the largest price target upside. The projected annual revenue for Microsoft is 244,898MM, an increase of 17.97%. The projected annual non-GAAP EPS is 11.41. What is", "Fintel reports that on July 18, 2023, Wedbush reiterated coverage of Microsoft (NASDAQ:MSFT) with a Outperform recommendation. Analyst Price Forecast Suggests 1.35% Upside As of July 5, 2023, the average one-year price target for Microsoft is 350.38. The forecasts range from a low of 234.32 to a high of $420.00. The average price target represents an increase of 1.35% from its latest reported closing price of 345.73. See our leaderboard of companies with the largest price target upside. The projected annual revenue for Microsoft is 244,898MM, an increase of 17.97%. The projected annual non-GAAP EPS is 11.41. What is the"], "sentiments": ["positive", "positive", "neutral", "positive", "positive", "positive", "neutral", "positive"], "summaries": ["All photographs subject to copyright.", "All photographs subject to copyright.", "Fund’s net return in second quarter was 8.1% compared to Standard & Poor’s 8.7%, Russell 1000 Growth Index.", "Shares of the tech giant have risen 50% this year. Copilot is an AI-powered version of Office", "ChatGPT has been on an absolute tear thanks to artificial intelligence.", "Mega-cap growth stocks outperformed Russell 1000 Growth Index in second quarter. Fund’s top five holdings are Microsoft, Facebook, Alphabet, Amazon.", "JP Morgan maintains coverage of Microsoft with a Overweight recommendation.", "Analyst price forecast suggests an increase of 1.35% over next year."]}, "TXN": {"name": ["A Look Into Texas Instruments&#39; (NASDAQ:<b>TXN</b>) Impressive Returns On Capital", "Unusual Call Option Trade in Texas Instruments (<b>TXN</b>) Worth $1,995.00K", "Texas Instruments Incorporated (<b>TXN</b>) May Have A Gold Mine.", "What&#39;s in the Offing for Texas Instruments (<b>TXN</b>) in Q2 Earnings?", "Selling Your Texas Instruments Incorporated (NASDAQ: <b>TXN</b>) Stock? Here’s What You Need To Know", "Mizuho Maintains Texas Instruments (<b>TXN</b>) Neutral Recommendation", "Texas Instruments Unusual Options Activity", "Texas Instruments Incorporated (<b>TXN</b>) Stock Records 2.47% Quarterly Movement"], "description": ["Did you know there are some financial metrics that can provide clues of a potential multi-bagger? Amongst other", "On July 21, 2023 at 15:50:03 ET an unusually large $1,995.00K block of Call contracts in Texas Instruments (<b>TXN</b>) was bought, with a strike price of $200.00 / share, expiring in 182 day(s) (on January 19, 2024). Fintel tracks all large options trades ...", "Texas Instruments Incorporated (NASDAQ:TXN) price on Friday, July 21, rose 2.45% above its previous day’s close as an upside momentum from buyers pushed the stock’s value to $184.32. A look at the stock’s price movement,", "Texas Instruments&#39; (TXN) second-quarter 2022 results are likely to reflect the adverse effects of inventory reduction on Analog and Embedded Processing segments.", "Texas Instruments Incorporated (NASDAQ:TXN) shares, rose in value on Friday, July 07, with the stock price up by 0.48% to the previous day’s close as strong demand from buyers drove the stock to $175.", "Fintel reports that on July 20, 2023, Mizuho maintained coverage of Texas Instruments (NASDAQ:<b>TXN</b>) with a Neutral recommendation. Analyst Price Forecast Suggests 2.51% Upside As of July 6, 2023, the average one-year price target for Texas Instruments is ...", "In terms of liquidity and interest, the mean open interest for Texas Instruments options trades today is 1554.12 with a total volume of 1,617.00.", "The stock of Texas Instruments Incorporated (TXN) has gone up by 2.21% for the week, with a 3.55% rise in the past month and a 2.47% rise in the past quarter. The volatility ratio for the week is 1.84%,"], "datePublished": ["2023-07-23T12:00:00.0000000Z", "2023-07-23T03:17:00.0000000Z", "2023-07-22T15:36:00.0000000Z", "2023-07-20T14:53:00.0000000Z", "2023-07-07T20:37:00.0000000Z", "2023-07-21T15:44:00.0000000Z", "2023-07-20T20:45:00.0000000Z", "2023-07-18T07:04:00.0000000Z"], "url": ["https://finance.yahoo.com/news/look-texas-instruments-nasdaq-txn-120036161.html", "https://www.msn.com/en-us/money/companies/unusual-call-option-trade-in-texas-instruments-txn-worth-dollar199500k/ar-AA1ecS2j", "https://stocksregister.com/2023/07/22/texas-instruments-incorporated-txn-may-have-a-gold-mine/", "https://finance.yahoo.com/news/whats-offing-texas-instruments-txn-145300746.html", "https://stocksregister.com/2023/07/07/selling-your-texas-instruments-incorporated-nasdaq-txn-stock-heres-what-you-need-to-know/", "https://www.msn.com/en-us/money/companies/mizuho-maintains-texas-instruments-txn-neutral-recommendation/ar-AA1eaZS9", "https://www.benzinga.com/markets/options/23/07/33312387/texas-instruments-unusual-options-activity", "https://newsheater.com/2023/07/18/texas-instruments-incorporated-txn-stock-records-2-47-quarterly-movement/"], "texts": ["Did you know there are some financial metrics that can provide clues of a potential multi-bagger? Amongst other things, we'll want to see two things; firstly, a growing return on capital employed (ROCE) and secondly, an expansion in the company's amount of capital employed. Ultimately, this demonstrates that it's a business that is reinvesting profits at increasing rates of return. Ergo, when we looked at the ROCE trends at Texas Instruments (NASDAQ:TXN), we liked what we saw. What Is Return On Capital Employed (ROCE)? For those who don't know, ROCE is a measure of a company's yearly pre-tax profit (its", "", "Texas Instruments Incorporated (NASDAQ:TXN) price on Friday, July 21, rose 2.45% above its previous day’s close as an upside momentum from buyers pushed the stock’s value to $184.32. A look at the stock’s price movement, the close in the last trading session was $179.92, moving within a range at $181.355 and $185.57. The PE ratio in trailing twelve months stood at 20.68. Turning to its 52-week performance, $186.30 and $145.97 were the 52-week high and 52-week low respectively. Overall, TXN moved 8.12% over the past month. Top 5 AI Stocks to Buy for 2023 The artificial intelligence (AI) revolution is", "Texas Instruments Incorporated TXN is scheduled to report second-quarter 2023 results on Jul 25. For second-quarter 2023, Texas Instruments expects revenues between $4.17 billion and $4.53 billion. The Zacks Consensus Estimate is pegged at $4.36 billion, suggesting a decline of 16.4% from the year-ago quarter’s reported figure. Management expects earnings of $1.62-$1.88 per share for the quarter under review. The consensus mark is pegged at $1.76 per share, indicating a fall of 28.2% from the prior-year quarter’s reported figure. The estimate has remained unchanged over the past 30 days. TXN’s earnings surpassed the Zacks Consensus Estimate in all the trailing", "Texas Instruments Incorporated (NASDAQ:TXN) shares, rose in value on Friday, July 07, with the stock price up by 0.48% to the previous day’s close as strong demand from buyers drove the stock to $175.66. Actively observing the price movement in the recent trading, the stock is buoying the session at $174.82, falling within a range of $173.08 and $175.48. The value of beta (5-year monthly) is 1.02 whereas the PE ratio is 19.62 over 12-month period. Referring to stock’s 52-week performance, its high was $186.30, and the low was $145.97. On the whole, TXN has fluctuated by 3.11% over the", "", "A whale with a lot of money to spend has taken a noticeably bearish stance on Texas Instruments. Looking at options history for Texas Instruments TXN we detected 14 strange trades. If we consider the specifics of each trade, it is accurate to state that 35% of the investors opened trades with bullish expectations and 64% with bearish. From the overall spotted trades, 6 are puts, for a total amount of $667,765 and 8, calls, for a total amount of $379,357. What's The Price Target? Taking into account the Volume and Open Interest on these contracts, it appears that whales", "The stock of Texas Instruments Incorporated (TXN) has gone up by 2.21% for the week, with a 3.55% rise in the past month and a 2.47% rise in the past quarter. The volatility ratio for the week is 1.84%, and the volatility levels for the past 30 days are 1.92% for TXN. The simple moving average for the last 20 days is 4.02% for TXN stock, with a simple moving average of 6.86% for the last 200 days. Is It Worth Investing in Texas Instruments Incorporated (NASDAQ: TXN) Right Now? Texas Instruments Incorporated (NASDAQ: TXN) has a higher price-to-earnings ratio"], "sentiments": ["neutral", "positive", "positive", "neutral", "positive", "positive", "negative", "positive"], "summaries": ["Return on Capital Employed (ROCE) is a measure of Proceeds relative to assets.", "All photographs subject to copyright.", "A look at the stock’s price movement, close in last trading session was $184.32.", "Management expects second-quarter revenues to decline 16.4% from year-ago quarter.", "Texas Instruments Incorporated (TXN) shares up by 0.48% in previous day’s close.", "All photographs subject to copyright.", "Whales have taken a bearish stance on the stock.", "Shares of Texas Instruments Incorporated (TXN) have been showing 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299 888-353-1299"]}}